Script started on 2021-09-09 15:06:06-04:00 [TERM="xterm" TTY="/dev/pts/14" COLUMNS="80" LINES="24"]
akozina2@remote01:~/cs220/i220b/submit/lab2$ cd exercises
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises$ cd 1-hello-args
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ ls
hello.c  Makefile  README
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ ls -l
total 12
-rw-r----- 1 akozina2 akozina2 343 Sep  9 13:19 hello.c
-rw-r----- 1 akozina2 akozina2  35 Sep  9 13:19 Makefile
-rw-r----- 1 akozina2 akozina2  61 Sep  9 13:19 README
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ emacs README [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[KE
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[24d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[23d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ---------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[24d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[24;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[24;54H[?25ldone[H
[?12l[?25h[?12;25h[24;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[24;59H[?25ldone[H
[?12l[?25h[?12;25h[24;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[24;58H[?25ldone[H
[?12l[?25h[?12;25h[24;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[24;60H[?25ldone[H
[?12l[?25h[?12;25h[24;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[24;57H[?25ldone[H
[?12l[?25h[?12;25h[24;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[24;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[24;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[24d[?25le[K[H[7mFile Edit Options Buffers Tools Help                                            [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ---------------------------[0m[39;49m[27m
[A
Loading /var/cache/dictionaries-common/emacsen-ispell-default.el (source)...don\
[A[2d[?12l[?25h[?12;25h[24d[K[A	[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[23;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[23;75H[?25ldone[H
[?12l[?25h[?12;25h[23;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[23;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[23;61H[?25ldone[H
[?12l[?25h[?12;25h[23;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[24d[?25ls.el (source)...[23;10Husr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoload\
[2d[?12l[?25h[?12;25h[24;17H[?25ldone[H
[?12l[?25h[?12;25h[24d[K[23;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[23;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[23;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[23;75H[?25ldone[H
[?12l[?25h[?12;25h[23;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[23;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[23;64H[?25ldone[H
[?12l[?25h[?12;25h[23;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[23;54H[?25ldone[H
[?12l[?25h[?12;25h[23;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[23;65H[?25ldone[H
[?12l[?25h[?12;25h[23;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[23;54H[?25ldone[H
[?12l[?25h[?12;25h[23;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[23;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[24d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                           [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) ----------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[24d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Help                                            [0m[39;49m[27m
[A
Print out a line saying hello to each command-line argument.[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mREADME      [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit-lab2[0m[39;49m[27m[7m  (Fundamental) ------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[24d[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[1]+  Stopped                 emacs README
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ make
cc -g -Wall -std=c18    hello.c   -o hello
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ ./hello
usage: ./hello NAME...
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ ./hello bart lisa
hello bartlisa
hello (null)
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ ./hello bartlisa[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
 lisa[C
hello bart
hello lisa
hello (null)
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start bart lisa
Temporary breakpoint 1 at 0x118b: file hello.c, line 13.
Starting program: /import/linux/home1/akozina2/projects/cs220/i220b/submit/lab2/exercises/1-hello-args/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe828) at hello.c:13
13	  if (argc == 1) {
(gdb) l
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
14	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
15	    exit(1);
16	  }
17	  else {
(gdb) 
18	    for (int i = 1; i <= argc; i++) {
19	      say_hello(argv[i]);
20	    }
21	  }
22	  return 0;
23	}
(gdb) l 18
13	  if (argc == 1) {
14	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
15	    exit(1);
16	  }
17	  else {
18	    for (int i = 1; i <= argc; i++) {
19	      say_hello(argv[i]);
20	    }
21	  }
22	  return 0;
(gdb) l18
Undefined command: "l18".  Try "help".
(gdb) b say-[K_hello
Breakpoint 2 at 0x555555555161: file hello.c, line 7.
(gdb) p RGC[K[K[KARGC[K[K[K[Kargc
$1 = 3
(gdb) p argv
$2 = (const char **) 0x7fffffffe828
(gdb) p ag[Krgv[0]
$3 = 0x7fffffffea95 "/import/linux/home1/akozina2/projects/cs220/i220b/submit/lab2/exercises/1-hello-args/hello"
(gdb) n
18	    for (int i = 1; i <= argc; i++) {
(gdb) n
19	      say_hello(argv[i]);
(gdb) c
Continuing.

Breakpoint 2, say_hello (name=0x7fffffffeaf0 "bart") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) l
2	#include <stdlib.h>
3	
4	static void
5	say_hello(const char *name)
6	{
7	  printf("hello %s\n", name);
8	}
9	
10	int 
11	main(int argc, const char *argv[])
(gdb) p
$4 = 0x7fffffffea95 "/import/linux/home1/akozina2/projects/cs220/i220b/submit/lab2/exercises/1-hello-args/hello"
(gdb) p name
$5 = 0x7fffffffeaf0 "bart"
(gdb) backtrace
#0  say_hello (name=0x7fffffffeaf0 "bart") at hello.c:7
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe828) at hello.c:19
(gdb) up
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe828) at hello.c:19
19	      say_hello(argv[i]);
(gdb) p argc
$6 = 3
(gdb) p argv[K[K[K[K[K[Kdown
#0  say_hello (name=0x7fffffffeaf0 "bart") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) p name
$7 = 0x7fffffffeaf0 "bart"
(gdb) c
Continuing.
hello bart

Breakpoint 2, say_hello (name=0x7fffffffeaf5 "lisa") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) p name
$8 = 0x7fffffffeaf5 "lisa"
(gdb) c
Continuing.
hello lisa

Breakpoint 2, say_hello (name=0x0) at hello.c:7
7	  printf("hello %s\n", name);
(gdb) p name
$9 = 0x0
(gdb) up
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe828) at hello.c:19
19	      say_hello(argv[i]);
(gdb) p i
$10 = 3
(gdb) p argc
$11 = 3
(gdb) q
A debugging session is active.

	Inferior 1 [process 88974] will be killed.

Quit anyway? (y or n) y
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ emacs[K[K[K[K[Kls
hello  hello.c	Makefile  README
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ emacs Makefi le[K[Aakozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ emacs Makefile[Kakozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ emacs Makefile
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[28d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[27d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[28;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[28;54H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[28;59H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[28;58H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[28;60H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[28;57H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[28;77H[?25ldone[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[28;75H[?25ldone[H
[?12l[?25h[?12;25h[28;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[28;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28;61H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[28;4H[?25ldone[H
[?12l[?25h[?12;25h[28d[K[27;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[27;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[27;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[27;75H[?25ldone[H
[?12l[?25h[?12;25h[27;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[27;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[27;64H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[27;65H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[27;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Makefile Help                                                [0m[39;49m[27m
[A
[33mCFLAGS[39;49m = -g -Wall -std=c18[K
[K
[1m[34mhello[0m[39;49m:[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mMakefile    [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit-lab2[0m[39;49m[27m[7m  (GNUmakefile) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lBeginning of buffer[K[H
[?12l[?25h[?12;25h[28d[K[27;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[27;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[27;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[27;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[27;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[28d[?25lEnd of buffer[5;1H[?12l[?25h[?12;25h[28d[K[27;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[27;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[27;34H[?25l[7m1[0m[39;49m[27m[H
[?12l[?25h[?12;25h[28d[?25lBeginning of buffer[H
[?12l[?25h[?12;25h[28d[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[2]+  Stopped                 emacs Makefile
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ emacs hello
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[28d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[27d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[28;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[28;54H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[28;59H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[28;58H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[28;60H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[28;57H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[28;77H[?25ldone[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[28;75H[?25ldone[H
[?12l[?25h[?12;25h[28;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[28;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28;61H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[28;4H[?25ldone[H
[?12l[?25h[?12;25h[28d[K[27;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[27;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[27;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[27;75H[?25ldone[H
[?12l[?25h[?12;25h[27;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[27;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[27;64H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[27;65H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[27;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[36m^?[39;49mELF[36m^B^A^A^@^@^@^@^@^@^@^@^@^C^@[39;49m>[36m^@^A^@^@^@[39;49mp[36m^P^@^@^@^@^@^@[39;49m@[36m^@^@^@^@^@^@^@\350[39;49mB[36m^@^@^@^@^@^@^[39;49m\
[A
[36m@^@^@^@[39;49m@[36m^@[39;49m8[36m^@^K^@[39;49m@[36m^@[39;49m#[36m^@[39;49m"[36m^@^F^@^@^@^D^@^@^@[39;49m@[36m^@^@^@^@^@^@^@[39;49m@[36m^@^@^@^@^@^@^@[39;49m@[36m^@^@^@^@^@^@^@[39;49mh[36m^B^@[39;49m\
[A
[36m^@^@^@^@^@[39;49mh[36m^B^@^@^@^@^@^@^H^@^@^@^@^@^@^@^C^@^@^@^D^@^@^@\250^B^@^@^@^@^@^@\250^B^@^@^@^@^@^[39;49m\
[A
[36m@\250^B^@^@^@^@^@^@^\^@^@^@^@^@^@^@^\^@^@^@^@^@^@^@^A^@^@^@^@^@^@^@^A^@^@^@^D^@^@^@^@^@^@^@^[39;49m\
[A
[36m@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^H^F^@^@^@^@^@^@^H^F^@^@^@^@^@^@^@^P^@^@^@^@^@^@^A^@^[39;49m\
[A
[36m@^@^E^@^@^@^@^P^@^@^@^@^@^@^@^P^@^@^@^@^@^@^@^P^@^@^@^@^@^@[39;49mm[36m^B^@^@^@^@^@^@[39;49mm[36m^B^@^@^@^@^@^@^@^[39;49m\
[A
[36mP^@^@^@^@^@^@^A^@^@^@^D^@^@^@^@[39;49m [36m^@^@^@^@^@^@^@[39;49m [36m^@^@^@^@^@^@^@[39;49m [36m^@^@^@^@^@^@\220^A^@^@^@^@^@^@[39;49m\
[A
[36m\220^A^@^@^@^@^@^@^@^P^@^@^@^@^@^@^A^@^@^@^F^@^@^@\350[39;49m-[36m^@^@^@^@^@^@\350[39;49m=[36m^@^@^@^@^@^@\350[39;49m=[36m^@^[39;49m\
[A
[36m@^@^@^@^@[39;49mX[36m^B^@^@^@^@^@^@[39;49mh[36m^B^@^@^@^@^@^@^@^P^@^@^@^@^@^@^B^@^@^@^F^@^@^@\370[39;49m-[36m^@^@^@^@^@^@\370[39;49m\
[A
=[36m^@^@^@^@^@^@\370[39;49m=[36m^@^@^@^@^@^@\340^A^@^@^@^@^@^@\340^A^@^@^@^@^@^@^H^@^@^@^@^@^@^@^D^@^@^@^D[39;49m\
[A
[36m^@^@^@\304^B^@^@^@^@^@^@\304^B^@^@^@^@^@^@\304^B^@^@^@^@^@^@[39;49mD[36m^@^@^@^@^@^@^@[39;49mD[36m^@^@^@^@^@^@^@^D[39;49m\
[A
[36m^@^@^@^@^@^@^@[39;49mP[36m\345[39;49mtd[36m^D^@^@^@[39;49m$ [36m^@^@^@^@^@^@[39;49m$ [36m^@^@^@^@^@^@[39;49m$ [36m^@^@^@^@^@^@[39;49mD[36m^@^@^@^@^@^@^@[39;49mD[36m^@^@^[39;49m\
[A
[36m@^@^@^@^@^D^@^@^@^@^@^@^@[39;49mQ[36m\345[39;49mtd[36m^F^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@[39;49m\
[A
[36m^@^@^@^@^@^@^@^@^@^@^@^@^@^@^P^@^@^@^@^@^@^@[39;49mR[36m\345[39;49mtd[36m^D^@^@^@\350[39;49m-[36m^@^@^@^@^@^@\350[39;49m=[36m^@^@^@^@^@^[39;49m\
[A
[36m@\350[39;49m=[36m^@^@^@^@^@^@^X^B^@^@^@^@^@^@^X^B^@^@^@^@^@^@^A^@^@^@^@^@^@^@[39;49m/lib64/ld-linux-x86-64.so.\
[A
2[36m^@^D^@^@^@^P^@^@^@^A^@^@^@[39;49mGNU[36m^@^@^@^@^@^C^@^@^@^B^@^@^@^@^@^@^@^D^@^@^@^T^@^@^@^C^@^@^@[39;49mGNU[36m^[39;49m\
[A
[36m@\275[39;49mO[36m\331\305[39;49mhP[36m\361\337[39;49m<[36m^Q\266[39;49my4[36m\302\202\342[39;49m|[36m\232[39;49m#[36m\207^B^@^@^@^H^@^@^@^A^@^@^@^F^@^@^@^@^A\[39;49m\
[A
[36m201^@^@^@^@^B^H^@^@^@[39;49m       [36m^@^@^@\321[39;49me[36m\316[39;49mm9[36m\362\213^\^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^[39;49m\
[A
[36m@^@^@^@^@^@[39;49mL[36m^@^@^@[39;49m [36m^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^X^@^@^@^R^@^@^@^@^@^@^@^@^@^@^@^@^[39;49m\
[A
[36m@^@^@^@^@^@^@[39;49m.[36m^@^@^@^R^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^W^@^@^@^R^@^@^@^@^@^@^@^@^@^@^@[39;49m\
[A
[36m^@^@^@^@^@^@^@^@[39;49mh[36m^@^@^@[39;49m [36m^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^K^@^@^@^R^@^@^@^@^@^@^@^@^@^@[39;49m\
[A
[36m^@^@^@^@^@^@^@^@^@[39;49mw[36m^@^@^@[39;49m [36m^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^_^@^@^@[39;49m"[36m^@^@^@^@^@^@^@^@^@^[39;49m\
[A
[36m@^@^@^@^@^@^@^@^@^@^P^@^@^@^Q^@^Y^@[39;49m@@[36m^@^@^@^@^@^@^H^@^@^@^@^@^@^@^@[39;49mlibc.so.6[36m^@[39;49mexit[36m^@[39;49mstderr[36m^@[39;49m\
[A
fprintf[36m^@[39;49m__cxa_finalize[36m^@[39;49m__libc_start_main[36m^@[39;49mGLIBC_2.2.5[36m^@[39;49m_ITM_deregisterTMCloneTable[36m^@[39;49m__gmon\
[A
_start__[36m^@[39;49m_ITM_registerTMCloneTable[36m^@^@^@^@^@^@^B^@^B^@^B^@^@^@^B^@^@^@^B^@^B^@^@^@^A^@^A^@^[39;49m\
[A
[7m-UU=:----F1  [0m[39;49m[27m[7m[1mhello       [0m[39;49m[27m[7m   Top L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[K[4d[4;92H




[28d[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[3]+  Stopped                 emacs hello
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ emacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[28d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[27d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[28;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[28;54H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[28;59H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[28;58H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[28;60H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[28;57H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[28;77H[?25ldone[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[28;75H[?25ldone[H
[?12l[?25h[?12;25h[28;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[28;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28;61H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[28;4H[?25ldone[H
[?12l[?25h[?12;25h[28d[K[27;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[27;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[27;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[27;75H[?25ldone[H
[?12l[?25h[?12;25h[27;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[27;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[27;64H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[27;65H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[27;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 1; i <= argc; i++) {[K
      say_hello(argv[i]);[K
    }[K
  }[K
  [1m[36mreturn[0m[39;49m 0;[K
}[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit-lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[K[27;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[27;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[27;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[27;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[27;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[27;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[27;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[27;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[27;34H[?25l[7m10[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[27;35H[?25l[7m1[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[27;35H[?25l[7m2[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[27;35H[?25l[7m3[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[27;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[27;35H[?25l[7m5[0m[39;49m[27m[16;1H[?12l[?25h[?12;25h[27;35H[?25l[7m6[0m[39;49m[27m[17;1H[?12l[?25h[?12;25h[27;35H[?25l[7m7[0m[39;49m[27m[18;1H[?12l[?25h[?12;25h[27;35H[?25l[7m8[0m[39;49m[27m[19;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[?25l[1P[27;6H[7m**[0m[39;49m[27m[19;18H[?12l[?25h[?12;25h[?25l[1@0[?12l[?25h[?12;25h[C[C[C[C		[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1@1[?12l[?25h[?12;25h[28;1H[?25lSaving file /home/akozina2/cs220/i220b/submit/lab2/exercises/1-hello-args/hello.c...[19;19H[?12l[?25h[?12;25h[28;1H[?25lWrote /home/akozina2/cs220/i220b/submit/lab2/exercises/1-hello-args/hello.c[K[19;19H[?12l[?25h[?12;25h[27;6H[?25l[7m----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L18   [0m[39;49m[27m[7mGit:[0m[39;49m[27m[19;19H[?12l[?25h[?12;25h[28;1H[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[4]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ ./hello
usage: ./hello NAME...
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ ./ [Khello bart lisa
hello bart
hello lisa
hello (null)
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ ./hello bart lisa[Kemacs hello.c[K
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[28d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[27d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[28;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[28;54H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[28;59H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[28;58H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[28;60H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[28;57H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[28;77H[?25ldone[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[28;75H[?25ldone[H
[?12l[?25h[?12;25h[28;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[28;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28;61H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[28;4H[?25ldone[H
[?12l[?25h[?12;25h[28d[K[27;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[27;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[27;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[27;75H[?25ldone[H
[?12l[?25h[?12;25h[27;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[27;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[27;64H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[27;65H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[27;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[36m^?[39;49mELF[36m^B^A^A^@^@^@^@^@^@^@^@^@^C^@[39;49m>[36m^@^A^@^@^@[39;49mp[36m^P^@^@^@^@^@^@[39;49m@[36m^@^@^@^@^@^@^@\350[39;49mB[36m^@^@^@^@^@^@^[39;49m\
[A
[36m@^@^@^@[39;49m@[36m^@[39;49m8[36m^@^K^@[39;49m@[36m^@[39;49m#[36m^@[39;49m"[36m^@^F^@^@^@^D^@^@^@[39;49m@[36m^@^@^@^@^@^@^@[39;49m@[36m^@^@^@^@^@^@^@[39;49m@[36m^@^@^@^@^@^@^@[39;49mh[36m^B^@[39;49m\
[A
[36m^@^@^@^@^@[39;49mh[36m^B^@^@^@^@^@^@^H^@^@^@^@^@^@^@^C^@^@^@^D^@^@^@\250^B^@^@^@^@^@^@\250^B^@^@^@^@^@^[39;49m\
[A
[36m@\250^B^@^@^@^@^@^@^\^@^@^@^@^@^@^@^\^@^@^@^@^@^@^@^A^@^@^@^@^@^@^@^A^@^@^@^D^@^@^@^@^@^@^@^[39;49m\
[A
[36m@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^H^F^@^@^@^@^@^@^H^F^@^@^@^@^@^@^@^P^@^@^@^@^@^@^A^@^[39;49m\
[A
[36m@^@^E^@^@^@^@^P^@^@^@^@^@^@^@^P^@^@^@^@^@^@^@^P^@^@^@^@^@^@[39;49mm[36m^B^@^@^@^@^@^@[39;49mm[36m^B^@^@^@^@^@^@^@^[39;49m\
[A
[36mP^@^@^@^@^@^@^A^@^@^@^D^@^@^@^@[39;49m [36m^@^@^@^@^@^@^@[39;49m [36m^@^@^@^@^@^@^@[39;49m [36m^@^@^@^@^@^@\220^A^@^@^@^@^@^@[39;49m\
[A
[36m\220^A^@^@^@^@^@^@^@^P^@^@^@^@^@^@^A^@^@^@^F^@^@^@\350[39;49m-[36m^@^@^@^@^@^@\350[39;49m=[36m^@^@^@^@^@^@\350[39;49m=[36m^@^[39;49m\
[A
[36m@^@^@^@^@[39;49mX[36m^B^@^@^@^@^@^@[39;49mh[36m^B^@^@^@^@^@^@^@^P^@^@^@^@^@^@^B^@^@^@^F^@^@^@\370[39;49m-[36m^@^@^@^@^@^@\370[39;49m\
[A
=[36m^@^@^@^@^@^@\370[39;49m=[36m^@^@^@^@^@^@\340^A^@^@^@^@^@^@\340^A^@^@^@^@^@^@^H^@^@^@^@^@^@^@^D^@^@^@^D[39;49m\
[A
[36m^@^@^@\304^B^@^@^@^@^@^@\304^B^@^@^@^@^@^@\304^B^@^@^@^@^@^@[39;49mD[36m^@^@^@^@^@^@^@[39;49mD[36m^@^@^@^@^@^@^@^D[39;49m\
[A
[36m^@^@^@^@^@^@^@[39;49mP[36m\345[39;49mtd[36m^D^@^@^@[39;49m$ [36m^@^@^@^@^@^@[39;49m$ [36m^@^@^@^@^@^@[39;49m$ [36m^@^@^@^@^@^@[39;49mD[36m^@^@^@^@^@^@^@[39;49mD[36m^@^@^[39;49m\
[A
[36m@^@^@^@^@^D^@^@^@^@^@^@^@[39;49mQ[36m\345[39;49mtd[36m^F^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@[39;49m\
[A
[36m^@^@^@^@^@^@^@^@^@^@^@^@^@^@^P^@^@^@^@^@^@^@[39;49mR[36m\345[39;49mtd[36m^D^@^@^@\350[39;49m-[36m^@^@^@^@^@^@\350[39;49m=[36m^@^@^@^@^@^[39;49m\
[A
[36m@\350[39;49m=[36m^@^@^@^@^@^@^X^B^@^@^@^@^@^@^X^B^@^@^@^@^@^@^A^@^@^@^@^@^@^@[39;49m/lib64/ld-linux-x86-64.so.\
[A
2[36m^@^D^@^@^@^P^@^@^@^A^@^@^@[39;49mGNU[36m^@^@^@^@^@^C^@^@^@^B^@^@^@^@^@^@^@^D^@^@^@^T^@^@^@^C^@^@^@[39;49mGNU[36m^[39;49m\
[A
[36m@\275[39;49mO[36m\331\305[39;49mhP[36m\361\337[39;49m<[36m^Q\266[39;49my4[36m\302\202\342[39;49m|[36m\232[39;49m#[36m\207^B^@^@^@^H^@^@^@^A^@^@^@^F^@^@^@^@^A\[39;49m\
[A
[36m201^@^@^@^@^B^H^@^@^@[39;49m       [36m^@^@^@\321[39;49me[36m\316[39;49mm9[36m\362\213^\^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^[39;49m\
[A
[36m@^@^@^@^@^@[39;49mL[36m^@^@^@[39;49m [36m^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^X^@^@^@^R^@^@^@^@^@^@^@^@^@^@^@^@^[39;49m\
[A
[36m@^@^@^@^@^@^@[39;49m.[36m^@^@^@^R^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^W^@^@^@^R^@^@^@^@^@^@^@^@^@^@^@[39;49m\
[A
[36m^@^@^@^@^@^@^@^@[39;49mh[36m^@^@^@[39;49m [36m^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^K^@^@^@^R^@^@^@^@^@^@^@^@^@^@[39;49m\
[A
[36m^@^@^@^@^@^@^@^@^@[39;49mw[36m^@^@^@[39;49m [36m^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^@^_^@^@^@[39;49m"[36m^@^@^@^@^@^@^@^@^@^[39;49m\
[A
[36m@^@^@^@^@^@^@^@^@^@^P^@^@^@^Q^@^Y^@[39;49m@@[36m^@^@^@^@^@^@^H^@^@^@^@^@^@^@^@[39;49mlibc.so.6[36m^@[39;49mexit[36m^@[39;49mstderr[36m^@[39;49m\
[A
fprintf[36m^@[39;49m__cxa_finalize[36m^@[39;49m__libc_start_main[36m^@[39;49mGLIBC_2.2.5[36m^@[39;49m_ITM_deregisterTMCloneTable[36m^@[39;49m__gmon\
[A
_start__[36m^@[39;49m_ITM_registerTMCloneTable[36m^@^@^@^@^@^@^B^@^B^@^B^@^@^@^B^@^@^@^B^@^B^@^@^@^A^@^A^@^[39;49m\
[A
[7m-UU=:----F1  [0m[39;49m[27m[7m[1mhello       [0m[39;49m[27m[7m   Top L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[5]+  Stopped                 emacs hello
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ emacs hello./hello bart lisa[Kemacs hello.c[K.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[28d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[27d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[28;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[28;54H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[28;59H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[28;58H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[28;60H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[28;57H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[28;77H[?25ldone[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[28;75H[?25ldone[H
[?12l[?25h[?12;25h[28;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[28;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28;61H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[28;4H[?25ldone[H
[?12l[?25h[?12;25h[28d[K[27;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[27;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[27;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[27;75H[?25ldone[H
[?12l[?25h[?12;25h[27;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[27;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[27;64H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[27;65H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[27;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 1; i < argc; i++) {[K
      say_hello(argv[i]);[K
    }[K
  }[K
  [1m[36mreturn[0m[39;49m 0;[K
}[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit:lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[K[27;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[27;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[27;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[27;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[27;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[27;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[27;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[27;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[27;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[27;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[27;34H[?25l[7m10[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[27;35H[?25l[7m1[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[27;35H[?25l[7m2[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[27;35H[?25l[7m3[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[27;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[27;35H[?25l[7m5[0m[39;49m[27m[16;1H[?12l[?25h[?12;25h[27;35H[?25l[7m6[0m[39;49m[27m[17;1H[?12l[?25h[?12;25h[C[C[C[27;35H[?25l[7m7[0m[39;49m[27m[18;1H[?12l[?25h[?12;25h[27;35H[?25l[7m8[0m[39;49m[27m[19;1H[?12l[?25h[?12;25h[27;35H[?25l[7m9[0m[39;49m[27m[20;1H[?12l[?25h[?12;25h[27;35H[?25l[7m8[0m[39;49m[27m[19;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[?25l[1P[27;6H[7m**[0m[39;49m[27m[19;18H[?12l[?25h[?12;25h[?25l[1@0[?12l[?25h[?12;25h[28;1H[?25lSaving file /home/akozina2/cs220/i220b/submit/lab2/exercises/1-hello-args/hello.c...[19;19H[?12l[?25h[?12;25h[28;1H[?25lWrote /home/akozina2/cs220/i220b/submit/lab2/exercises/1-hello-args/hello.c[K[19;19H[?12l[?25h[?12;25h[27;6H[?25l[7m--[0m[39;49m[27m[19;19H[?12l[?25h[?12;25h[28;1H[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[6]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ emacs hello.c[K./hello bart lisa[K
usage: ./hello NAME...
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ ./helloemacs hello.c[K./hello bart lisa
hello bart
hello lisa
hello (null)
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ ./hello bart lisa[Kemacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[28d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[27d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[28;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[28;54H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[28;59H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[28;58H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[28;60H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[28;57H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[28;77H[?25ldone[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[28;75H[?25ldone[H
[?12l[?25h[?12;25h[28;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[28;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28;61H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[28;4H[?25ldone[H
[?12l[?25h[?12;25h[28d[K[27;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[27;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[27;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[27;75H[?25ldone[H
[?12l[?25h[?12;25h[27;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[27;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[27;64H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[27;65H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[27;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < argc; i++) {[K
      say_hello(argv[i]);[K
    }[K
  }[K
  [1m[36mreturn[0m[39;49m 0;[K
}[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit:lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[K[27;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[27;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[27;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[27;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[27;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[27;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[27;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[27;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[27;34H[?25l[7m10[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[27;35H[?25l[7m1[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[27;35H[?25l[7m2[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[27;35H[?25l[7m3[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[27;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[C[C[C[C[27;35H[?25l[7m5[0m[39;49m[27m[16;5H[?12l[?25h[?12;25h[27;35H[?25l[7m6[0m[39;49m[27m[17;4H[?12l[?25h[?12;25h[27;35H[?25l[7m7[0m[39;49m[27m[18;5H[?12l[?25h[?12;25h[27;35H[?25l[7m8[0m[39;49m[27m[19;5H[?12l[?25h[?12;25h[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[?25l[1@=[27;6H[7m**[0m[39;49m[27m[19;25H[?12l[?25h[?12;25h[28;1H[?25lSaving file /home/akozina2/cs220/i220b/submit/lab2/exercises/1-hello-args/hello.c...[19;25H[?12l[?25h[?12;25h[28;1H[?25lWrote /home/akozina2/cs220/i220b/submit/lab2/exercises/1-hello-args/hello.c[K[19;25H[?12l[?25h[?12;25h[27;6H[?25l[7m--[0m[39;49m[27m[19;25H[?12l[?25h[?12;25h[28;1H[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[7]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ make
cc -g -Wall -std=c18    hello.c   -o hello
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ makeemacs hello.c./hello bart lisa[K
usage: ./hello NAME...
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ ./hello[3Pmakeemacs hello.c./hello bart lisa
hello ./hello
hello bart
hello lisa
hello (null)
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ e[K./hello bart lisa[K[3Pmakeemacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[28d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[27d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[28;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[28;54H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[28;59H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[28;58H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[28;60H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[28;57H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[28;77H[?25ldone[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[28;75H[?25ldone[H
[?12l[?25h[?12;25h[28;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[28;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28;61H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[28;4H[?25ldone[H
[?12l[?25h[?12;25h[28d[K[27;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[27;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[27;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[27;75H[?25ldone[H
[?12l[?25h[?12;25h[27;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[27;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[27;64H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[27;65H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[27;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i <= argc; i++) {[K
      say_hello(argv[i]);[K
    }[K
  }[K
  [1m[36mreturn[0m[39;49m 0;[K
}[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit:lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[K[27;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[27;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[27;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[27;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[27;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[27;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[27;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[27;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[27;34H[?25l[7m10[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[27;35H[?25l[7m1[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[27;35H[?25l[7m2[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[27;35H[?25l[7m3[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[27;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[27;35H[?25l[7m5[0m[39;49m[27m[16;1H[?12l[?25h[?12;25h[27;35H[?25l[7m6[0m[39;49m[27m[17;1H[?12l[?25h[?12;25h[27;35H[?25l[7m7[0m[39;49m[27m[18;1H[?12l[?25h[?12;25h[27;35H[?25l[7m8[0m[39;49m[27m[19;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C		[C[C[C[C[C[C		[C[C[?25l[1P[27;6H[7m**[0m[39;49m[27m[19;24H[?12l[?25h[?12;25h	[C[C[C[C[?25l-; i++) {[19;30H[?12l[?25h[?12;25h[?25l1; i++) {[19;31H[?12l[?25h[?12;25h[?25l[1@([?12l[?25h[?12;25h[C[C[C[C[C				[?25l[46m([39;49margc-1); i++) {				[?12l[?25h[?12;25h			[?25l(	[?12l[?25h[?12;25h[?25l; i++) {[K				[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[28;1H[?25lSaving file /home/akozina2/cs220/i220b/submit/lab2/exercises/1-hello-args/hello.c...[19;25H[?12l[?25h[?12;25h[28;1H[?25lWrote /home/akozina2/cs220/i220b/submit/lab2/exercises/1-hello-args/hello.c[K[19;25H[?12l[?25h[?12;25h[27;6H[?25l[7m--[0m[39;49m[27m[19;25H[?12l[?25h[?12;25h[28;1H[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[8]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ emacs hello.c[K[K[K[K[K[K[K[K[K[K[K[K[Kmake
cc -g -Wall -std=c18    hello.c   -o hello
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ makeemacs hello.c./hello bart lisa[K
usage: ./hello NAME...
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ ./hello[3Pmakeemacs hello.c./hello bart lisa
hello ./hello
hello bart
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ ema[K[K[K./hello bart lisa[K[3Pmakeemacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[28d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[27d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[28;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[28;54H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[28;59H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[28;58H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[28;60H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[28;57H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[28;77H[?25ldone[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[28;75H[?25ldone[H
[?12l[?25h[?12;25h[28;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[28;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28;61H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[28;4H[?25ldone[H
[?12l[?25h[?12;25h[28d[K[27;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[27;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[27;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[27;75H[?25ldone[H
[?12l[?25h[?12;25h[27;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[27;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[27;64H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[27;65H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[27;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < argc-1; i++) {[K
      say_hello(argv[i]);[K
    }[K
  }[K
  [1m[36mreturn[0m[39;49m 0;[K
}[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit:lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[K[27;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[27;34H[?25l[7m1[0m[39;49m[27m[H
[?12l[?25h[?12;25h[27;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[27;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[27;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[27;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[27;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[27;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[27;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[27;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[27;34H[?25l[7m10[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[27;35H[?25l[7m1[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[27;35H[?25l[7m2[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[27;35H[?25l[7m3[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[27;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[27;35H[?25l[7m5[0m[39;49m[27m[16;1H[?12l[?25h[?12;25h[27;35H[?25l[7m6[0m[39;49m[27m[17;1H[?12l[?25h[?12;25h[27;35H[?25l[7m7[0m[39;49m[27m[18;1H[?12l[?25h[?12;25h[27;35H[?25l[7m8[0m[39;49m[27m[19;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[?25l[1P[27;6H[7m**[0m[39;49m[27m[19;18H[?12l[?25h[?12;25h[?25l[1@1[?12l[?25h[?12;25h[C[C[C[C		[C[C[28;1H[?25lSaving file /home/akozina2/cs220/i220b/submit/lab2/exercises/1-hello-args/hello.c...[19;27H[?12l[?25h[?12;25h[28;1H[?25lWrote /home/akozina2/cs220/i220b/submit/lab2/exercises/1-hello-args/hello.c[K[19;27H[?12l[?25h[?12;25h[27;6H[?25l[7m--[0m[39;49m[27m[19;27H[?12l[?25h[?12;25h[28;1H[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[9]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ emacs hello.c./hello bart lisa[K[3Pmakeemacs hello.cmake[K
cc -g -Wall -std=c18    hello.c   -o hello
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ makeemacs hello.c./hello bart lisa
hello bart
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ ./hello bart lisamake[Kemacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[28d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[27d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[28;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[28;54H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[28;59H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[28;58H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[28;60H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[28;57H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[28;77H[?25ldone[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[28;75H[?25ldone[H
[?12l[?25h[?12;25h[28;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[28;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28;61H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[28;4H[?25ldone[H
[?12l[?25h[?12;25h[28d[K[27;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[27;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[27;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[27;75H[?25ldone[H
[?12l[?25h[?12;25h[27;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[27;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[27;64H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[27;65H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[27;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 1; i < argc-1; i++) {[K
      say_hello(argv[i]);[K
    }[K
  }[K
  [1m[36mreturn[0m[39;49m 0;[K
}[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit:lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[K[27;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[27;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[27;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[27;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[27;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[27;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[27;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[27;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[27;34H[?25l[7m10[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[27;35H[?25l[7m1[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[27;35H[?25l[7m2[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[27;35H[?25l[7m3[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[27;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[27;35H[?25l[7m5[0m[39;49m[27m[16;1H[?12l[?25h[?12;25h[27;35H[?25l[7m6[0m[39;49m[27m[17;1H[?12l[?25h[?12;25h[27;35H[?25l[7m7[0m[39;49m[27m[18;1H[?12l[?25h[?12;25h[27;35H[?25l[7m8[0m[39;49m[27m[19;1H[?12l[?25h[?12;25h[27;35H[?25l[7m9[0m[39;49m[27m[20;1H[?12l[?25h[?12;25h[27;35H[?25l[7m8[0m[39;49m[27m[19;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C[?25l; i++) {[K[27;6H[7m**[0m[39;49m[27m[19;30H[?12l[?25h[?12;25h[?25l; i++) {[K[19;29H[?12l[?25h[?12;25h[28;1H[?25lSaving file /home/akozina2/cs220/i220b/submit/lab2/exercises/1-hello-args/hello.c...[19;29H[?12l[?25h[?12;25h[28;1H[?25lWrote /home/akozina2/cs220/i220b/submit/lab2/exercises/1-hello-args/hello.c[K[19;29H[?12l[?25h[?12;25h[27;6H[?25l[7m--[0m[39;49m[27m[19;29H[?12l[?25h[?12;25h[28;1H[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[10]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ make
cc -g -Wall -std=c18    hello.c   -o hello
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ makeemacs hello.c./hello bart lisa
hello bart
hello lisa
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ p argv[0]
bash: p: command not found
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ cd .
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ cd -
/home/akozina2/cs220/i220b/submit/lab2/exercises/1-hello-args
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ cd-
bash: cd-: command not found
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/1-hello-args$ cd ..
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises$ cd 2-hello-upcase-args
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ls
hello.c  Makefile  README
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ make
cc -g -Wall -std=c18    hello.c   -o hello
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ make[2Plscd 2-hello-upcase-args[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C..[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[2P- -.p argv[0]./hello bart lisa
Hello Bart
Hello Lisa
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ./hello bart lisa[K[K[K[K[K[K[K[K[Klisa bart
Hello Lisa
Hello Bart
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ emacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[28d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[27d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[28;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[28;54H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[28;59H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[28;58H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[28;60H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[28;57H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[28;77H[?25ldone[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[28;75H[?25ldone[H
[?12l[?25h[?12;25h[28;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[28;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28;61H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[28;4H[?25ldone[H
[?12l[?25h[?12;25h[28d[K[27;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[27;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[27;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[27;75H[?25ldone[H
[?12l[?25h[?12;25h[27;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[27;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[27;64H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[27;65H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[27;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<ctype.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<string.h>[39;49m[K
[K
[32m/** Upcase the initial letter of each word from in, copying the [39;49m                             
[A
[32m *  results into out.  The caller is responsible to ensure that out [39;49m                         
[A
[32m *  has enough space for the strlen(in) characters of in. [39;49m                                   
[A
[32m */[39;49m[K
[32mvoid[39;49m[K
[1m[34mupcase_words[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m [33min[39;49m[], [32mchar[39;49m [33mout[39;49m[])[K
{[K
  [32mint[39;49m [33minWord[39;49m = 0;[K
  [32mint[39;49m [33mn[39;49m = strlen(in);[K
  [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < n; i++) {[K
    [1m[36mif[0m[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [1m[36melse[0m[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   Top L1    [0m[39;49m[27m[7mGit-lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lBeginning of buffer[K[H
[?12l[?25h[?12;25h[28d[K[27;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[27;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[27;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[27;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[27;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[27;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[27;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[27;34H[?25l[7m10[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[27;35H[?25l[7m1[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[27;35H[?25l[7m2[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[27;35H[?25l[7m3[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[27;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[27;35H[?25l[7m5[0m[39;49m[27m[16;1H[?12l[?25h[?12;25h[27;35H[?25l[7m6[0m[39;49m[27m[17;1H[?12l[?25h[?12;25h[27;35H[?25l[7m7[0m[39;49m[27m[18;1H[?12l[?25h[?12;25h[27;35H[?25l[7m8[0m[39;49m[27m[19;1H[?12l[?25h[?12;25h[27;35H[?25l[7m9[0m[39;49m[27m[20;1H[?12l[?25h[?12;25h[27;34H[?25l[7m20[0m[39;49m[27m[21;1H[?12l[?25h[?12;25h[27;35H[?25l[7m1[0m[39;49m[27m[22;1H[?12l[?25h[?12;25h[27;35H[?25l[7m2[0m[39;49m[27m[23;1H[?12l[?25h[?12;25h[27;35H[?25l[7m3[0m[39;49m[27m[24;1H[?12l[?25h[?12;25h[27;35H[?25l[7m4[0m[39;49m[27m[25;1H[?12l[?25h[?12;25h[27;35H[?25l[7m5[0m[39;49m[27m[A[?12l[?25h[?12;25h[2d[?25l  [32mint[39;49m [33mn[39;49m = strlen(in);
  [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < n; i++) {
    [1m[36mif[0m[39;49m (!inWord && isalpha(in[i])) {
      out[i] = toupper(in[i]);[6;5H}
    [1m[36melse[0m[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);
  }[K
}[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)
{[K
[Cprintf([32m"Hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])
{[K
[C[1m[36mif[0m[39;49m (argc == 1) {[K[24;3H  fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);
    exit(1);[26;3H}[27;29H[7m36% L26[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[27;35H[?25l[7m7[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[27;35H[?25l[7m8[0m[39;49m[27m[16;1H[?12l[?25h[?12;25h[27;35H[?25l[7m9[0m[39;49m[27m[17;1H[?12l[?25h[?12;25h[27;34H[?25l[7m30[0m[39;49m[27m[18;1H[?12l[?25h[?12;25h[27;35H[?25l[7m1[0m[39;49m[27m[19;1H[?12l[?25h[?12;25h[27;35H[?25l[7m2[0m[39;49m[27m[20;1H[?12l[?25h[?12;25h[27;35H[?25l[7m3[0m[39;49m[27m[21;1H[?12l[?25h[?12;25h[27;35H[?25l[7m4[0m[39;49m[27m[22;1H[?12l[?25h[?12;25h[27;35H[?25l[7m5[0m[39;49m[27m[23;1H[?12l[?25h[?12;25h[27;35H[?25l[7m6[0m[39;49m[27m[24;1H[?12l[?25h[?12;25h[27;35H[?25l[7m7[0m[39;49m[27m[25;1H[?12l[?25h[?12;25h[27;35H[?25l[7m8[0m[39;49m[27m[A[?12l[?25h[?12;25h[2d[?25l[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)
{[K
[Cprintf([32m"Hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])
{[K
[C[1m[36mif[0m[39;49m (argc == 1) {[K[11;3H  fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);
    exit(1);[13;3H}
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 1; i < argc; i++) {
      [1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m = argv[i];[17;3H    [32mchar[39;49m [33mfriendlyName[39;49m[strlen(name)];
      upcase_words(name, friendlyName);[19;7Hsay_hello(friendlyName);
    }
  }[K
  [1m[36mreturn[0m[39;49m 0;
}[K
[K
[K
[K[27;29H[7mBot L39[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[27;34H[?25l[7m40[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[27;35H[?25l[7m1[0m[39;49m[27m[16;1H[?12l[?25h[?12;25h[27;35H[?25l[7m2[0m[39;49m[27m[17;1H[?12l[?25h[?12;25h[27;35H[?25l[7m3[0m[39;49m[27m[18;1H[?12l[?25h[?12;25h[27;35H[?25l[7m4[0m[39;49m[27m[19;1H[?12l[?25h[?12;25h[27;35H[?25l[7m5[0m[39;49m[27m[20;1H[?12l[?25h[?12;25h[27;35H[?25l[7m6[0m[39;49m[27m[21;1H[?12l[?25h[?12;25h[27;35H[?25l[7m7[0m[39;49m[27m[22;1H[?12l[?25h[?12;25h[27;35H[?25l[7m8[0m[39;49m[27m[23;1H[?12l[?25h[?12;25h[27;35H[?25l[7m9[0m[39;49m[27m[24;1H[?12l[?25h[?12;25h



[?25lEnd of buffer[24;1H[?12l[?25h[?12;25h



[K[27;35H[?25l[7m8[0m[39;49m[27m[23;1H[?12l[?25h[?12;25h[27;35H[?25l[7m7[0m[39;49m[27m[22;1H[?12l[?25h[?12;25h[27;35H[?25l[7m6[0m[39;49m[27m[21;1H[?12l[?25h[?12;25h[27;35H[?25l[7m5[0m[39;49m[27m[20;1H[?12l[?25h[?12;25h[27;35H[?25l[7m4[0m[39;49m[27m[19;1H[?12l[?25h[?12;25h[27;35H[?25l[7m3[0m[39;49m[27m[18;1H[?12l[?25h[?12;25h[27;35H[?25l[7m2[0m[39;49m[27m[17;1H[?12l[?25h[?12;25h[27;35H[?25l[7m1[0m[39;49m[27m[16;1H[?12l[?25h[?12;25h[27;35H[?25l[7m0[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[27;34H[?25l[7m39[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[27;35H[?25l[7m8[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[27;35H[?25l[7m7[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[27;35H[?25l[7m6[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[27;35H[?25l[7m5[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[27;35H[?25l[7m4[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[27;35H[?25l[7m3[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[27;35H[?25l[7m2[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[27;35H[?25l[7m1[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[27;35H[?25l[7m0[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[27;34H[?25l[7m29[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[27;35H[?25l[7m8[0m[39;49m[27m[H

[?12l[?25h[?12;25h[27;35H[?25l[7m7[0m[39;49m[27m[H
[?12l[?25h[?12;25h[?25l  [32mint[39;49m [33mn[39;49m = strlen(in);[K
  [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < n; i++) {[4;3H  [1m[36mif[0m[39;49m (!inWord && isalpha(in[i])) {
      out[i] = toupper(in[i]);[6;5H}
    [1m[36melse[0m[39;49m {
      out[i] = in[i];[K
    }
  inWord = isalpha(in[i]);[11;3H}[K
}[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
[Cprintf([32m"Hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[24;5Hfprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[25;5Hexit(1);[26;3H}[27;29H[7m36% L26[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[27;35H[?25l[7m5[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[27;35H[?25l[7m4[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[27;35H[?25l[7m3[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[27;35H[?25l[7m2[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[27;35H[?25l[7m1[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[27;35H[?25l[7m0[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[27;34H[?25l[7m19[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[27;35H[?25l[7m8[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[27;35H[?25l[7m7[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[27;35H[?25l[7m6[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[27;35H[?25l[7m5[0m[39;49m[27m[H

[?12l[?25h[?12;25h[27;35H[?25l[7m4[0m[39;49m[27m[H
[?12l[?25h[?12;25h[?25l[1m[34m#include[0m[39;49m [32m<ctype.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<string.h>[39;49m[K
[K
[32m/** Upcase the initial letter of each word from in, copying the [39;49m                             
[32m *  results into out.  The caller is responsible to ensure that out [39;49m                         
[32m *  has enough space for the strlen(in) characters of in. [39;49m                                   
[32m */[39;49m[K
[32mvoid[39;49m
[1m[34mupcase_words[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m [33min[39;49m[], [32mchar[39;49m [33mout[39;49m[])
{
  [32mint[39;49m [33minWord[39;49m = 0;
  [32mint[39;49m [33mn[39;49m = strlen(in);[K
  [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < n; i++) {[17;3H  [1m[36mif[0m[39;49m (!inWord && isalpha(in[i])) {
      out[i] = toupper(in[i]);[19;5H}
    [1m[36melse[0m[39;49m {
      out[i] = in[i];[K
    }
  inWord = isalpha(in[i]);[24;3H}[K
}[K
[K[27;29H[7mTop L13[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[27;35H[?25l[7m2[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[27;35H[?25l[7m1[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[27;35H[?25l[7m0[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[27;34H[?25l[7m9 [0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[27;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[27;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[27;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[27;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[27;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[27;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[27;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[28d[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[11]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ emacs hello.c./hello lisa bart                 
Hello Lisa
Hello Bart
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ./hello lisa bart                [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C'lisa bart [C[C[C[C[C[C[C[C[C[C[C[C[C[C [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C bart[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cs bar[1@t[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Ci ba[1@r[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cm b[1@a[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cp [1@b[1@s[1@o[1@n[1@'[C[C[1@'[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C [C[C[C[C[C[C[C[C[C[C[C[1@s[1@i[1@m[1@p[1@s[1@o[1@n[1@'
Hello Lisa SimpsonU
Hello Bart SimpsonU
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) q
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ gdb hello./hello 'lisa simpson' 'bart simpson'                [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Clisa bart  [20P[C[C[C[C[C[C[C[C[C[C[C[C[C[C[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[5Pemacs hello.c
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[28d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[27d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[28;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[28;54H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[28;59H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[28;58H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[28;60H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[28;57H[?25ldone[H
[?12l[?25h[?12;25h[28;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[28;77H[?25ldone[H
[?12l[?25h[?12;25h[28;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[28;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[28;75H[?25ldone[H
[?12l[?25h[?12;25h[28;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[28;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28;61H[?25ldone[H
[?12l[?25h[?12;25h[28;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[28d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[28;4H[?25ldone[H
[?12l[?25h[?12;25h[28d[K[27;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[27;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[27;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[27;75H[?25ldone[H
[?12l[?25h[?12;25h[27;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[27;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[27;64H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[27;65H[?25ldone[H
[?12l[?25h[?12;25h[27;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[27;54H[?25ldone[H
[?12l[?25h[?12;25h[27;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[27;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<ctype.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<string.h>[39;49m[K
[K
[32m/** Upcase the initial letter of each word from in, copying the [39;49m                             
[A
[32m *  results into out.  The caller is responsible to ensure that out [39;49m                         
[A
[32m *  has enough space for the strlen(in) characters of in. [39;49m                                   
[A
[32m */[39;49m[K
[32mvoid[39;49m[K
[1m[34mupcase_words[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m [33min[39;49m[], [32mchar[39;49m [33mout[39;49m[])[K
{[K
  [32mint[39;49m [33minWord[39;49m = 0;[K
  [32mint[39;49m [33mn[39;49m = strlen(in);[K
  [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < n; i++) {[K
    [1m[36mif[0m[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [1m[36melse[0m[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   Top L1    [0m[39;49m[27m[7mGit-lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[28d[K[27;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[27;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[27;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[27;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[27;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[27;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[H[2J[45d[K[H[?25l[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<ctype.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<string.h>[39;49m[K
[K
[32m/** Upcase the initial letter of each word from in, copying the [39;49m                             
[A
[32m *  results into out.  The caller is responsible to ensure that out [39;49m                         
[A
[32m *  has enough space for the strlen(in) characters of in. [39;49m                                   
[A
[32m */[39;49m[K
[32mvoid[39;49m[K
[1m[34mupcase_words[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m [33min[39;49m[], [32mchar[39;49m [33mout[39;49m[])[K
{[K
  [32mint[39;49m [33minWord[39;49m = 0;[K
  [32mint[39;49m [33mn[39;49m = strlen(in);[K
  [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < n; i++) {[K
    [1m[36mif[0m[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [1m[36melse[0m[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"Hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 1; i < argc; i++) {[K
      [1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m = argv[i];[K
      [32mchar[39;49m [33mfriendlyName[39;49m[strlen(name)];[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   Top L9    [0m[39;49m[27m[7mGit-lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[10d[?12l[?25h[?12;25h[H[2J[55d[K[H[?25l[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<ctype.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<string.h>[39;49m[K
[K
[32m/** Upcase the initial letter of each word from in, copying the [39;49m                             
[A
[32m *  results into out.  The caller is responsible to ensure that out [39;49m                         
[A
[32m *  has enough space for the strlen(in) characters of in. [39;49m                                   
[A
[32m */[39;49m[K
[32mvoid[39;49m[K
[1m[34mupcase_words[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m [33min[39;49m[], [32mchar[39;49m [33mout[39;49m[])[K
{[K
  [32mint[39;49m [33minWord[39;49m = 0;[K
  [32mint[39;49m [33mn[39;49m = strlen(in);[K
  [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < n; i++) {[K
    [1m[36mif[0m[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [1m[36melse[0m[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"Hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 1; i < argc; i++) {[K
      [1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m = argv[i];[K
      [32mchar[39;49m [33mfriendlyName[39;49m[strlen(name)];[K
      upcase_words(name, friendlyName);[K
      say_hello(friendlyName);[K
    }[K
  }[K
  [1m[36mreturn[0m[39;49m 0;[K
}[K
[K
[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L9    [0m[39;49m[27m[7mGit-lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[10d[?12l[?25h[?12;25h[55d[?25lC-c[10;1H[?12l[?25h[?12;25h[55;4H[?25l-[10;1H[?12l[?25h[?12;25h[55;4H[?25l C-z[10;1H[?12l[?25h[?12;25h[55d[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[12]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start lisa bart
Temporary breakpoint 1 at 0x12be: file hello.c, line 35.
Starting program: /import/linux/home1/akozina2/projects/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello lisa bart

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe818) at hello.c:35
35	  if (argc == 1) {
(gdb) l
30	}
31	
32	int
33	main(int argc, const char *argv[])
34	{
35	  if (argc == 1) {
36	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
37	    exit(1);
38	  }
39	  else {
(gdb) b say_hello
Breakpoint 2 at 0x55555555528b: file hello.c, line 29.
(gdb) p argc
$1 = 3
(gdb) p argv[0]
$2 = 0x7fffffffea80 "/import/linux/home1/akozina2/projects/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello"
(gdb) n
40	    for (int i = 1; i < argc; i++) {
(gdb) n
41	      const char *name = argv[i];
(gdb) p i
$3 = 1
(gdb) c
Continuing.

Breakpoint 2, say_hello (name=0x7fffffffe6c0 "Lisa") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) l
24	}
25	
26	static void
27	say_hello(const char *name)
28	{
29	  printf("Hello %s\n", name);
30	}
31	
32	int
33	main(int argc, const char *argv[])
(gdb) p name
$4 = 0x7fffffffe6c0 "Lisa"
(gdb) backtrace
#0  say_hello (name=0x7fffffffe6c0 "Lisa") at hello.c:29
#1  0x0000555555555390 in main (argc=3, argv=0x7fffffffe818) at hello.c:44
(gdb) up
#1  0x0000555555555390 in main (argc=3, argv=0x7fffffffe818) at hello.c:44
44	      say_hello(friendlyName);
(gdb) p i
$5 = 1
(gdb) down
#0  say_hello (name=0x7fffffffe6c0 "Lisa") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) c
Continuing.
Hello Lisa

Breakpoint 2, say_hello (name=0x7fffffffe6c0 "Bart") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) p i[Kname
$6 = 0x7fffffffe6c0 "Bart"
(gdb) c
Continuing.
Hello Bart
[Inferior 1 (process 124831) exited normally]
(gdb) p name
$7 = '\000' <repeats 32 times>
(gdb) up
No stack.
(gdb) q
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start 'lisa simpson' 'bart simpson'
Temporary breakpoint 1 at 0x12be: file hello.c, line 35.
Starting program: /import/linux/home1/akozina2/projects/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello 'lisa simpson' 'bart simpson'

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe808) at hello.c:35
35	  if (argc == 1) {
(gdb) p i[K[K[Kl
30	}
31	
32	int
33	main(int argc, const char *argv[])
34	{
35	  if (argc == 1) {
36	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
37	    exit(1);
38	  }
39	  else {
(gdb) b say_hello
Breakpoint 2 at 0x55555555528b: file hello.c, line 29.
(gdb) p argc
$1 = 3
(gdb) p argv[0]
$2 = 0x7fffffffea70 "/import/linux/home1/akozina2/projects/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello"
(gdb) p argv[2[K1]
$3 = 0x7fffffffead2 "lisa simpson"
(gdb) argv[K[K[K[Kp argv[2]
$4 = 0x7fffffffeadf "bart simpson"
(gdb) p argv[3]
$5 = 0x0
(gdb) p argv[4[[K]
$6 = 0x7fffffffeaec "SHELL=/bin/bash"
(gdb) n
40	    for (int i = 1; i < argc; i++) {
(gdb) n
41	      const char *name = argv[i];
(gdb) p i
$7 = 1
(gdb) p name
$8 = 0x0
(gdb) c
Continuing.

Breakpoint 2, say_hello (name=0x7fffffffe6b0 "Lisa SimpsonUU") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) l
24	}
25	
26	static void
27	say_hello(const char *name)
28	{
29	  printf("Hello %s\n", name);
30	}
31	
32	int
33	main(int argc, const char *argv[])
(gdb) p name
$9 = 0x7fffffffe6b0 "Lisa SimpsonUU"
(gdb) p namel[Kc[Kbacktrace
#0  say_hello (name=0x7fffffffe6b0 "Lisa SimpsonUU") at hello.c:29
#1  0x0000555555555390 in main (argc=3, argv=0x7fffffffe808) at hello.c:44
(gdb) c
Continuing.
Hello Lisa SimpsonUU

Breakpoint 2, say_hello (name=0x7fffffffe6b0 "Bart SimpsonUU") at hello.c:29
29	  printf("Hello %s\n", name);
(gdb) p name
$10 = 0x7fffffffe6b0 "Bart SimpsonUU"
(gdb) c
Continuing.
Hello Bart SimpsonUU
[Inferior 1 (process 132760) exited normally]
(gdb) q
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ gdb helloemacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[55d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[54d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[55;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[55;54H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[55;59H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[55;58H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[55;60H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[55;57H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[55;77H[?25ldone[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[55;75H[?25ldone[H
[?12l[?25h[?12;25h[55;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[55;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55;61H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[55;4H[?25ldone[H
[?12l[?25h[?12;25h[55d[K[54;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[54;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[54;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[54;75H[?25ldone[H
[?12l[?25h[?12;25h[54;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[54;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[54;64H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[54;65H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[54;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<ctype.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<string.h>[39;49m[K
[K
[32m/** Upcase the initial letter of each word from in, copying the [39;49m                             
[A
[32m *  results into out.  The caller is responsible to ensure that out [39;49m                         
[A
[32m *  has enough space for the strlen(in) characters of in. [39;49m                                   
[A
[32m */[39;49m[K
[32mvoid[39;49m[K
[1m[34mupcase_words[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m [33min[39;49m[], [32mchar[39;49m [33mout[39;49m[])[K
{[K
  [32mint[39;49m [33minWord[39;49m = 0;[K
  [32mint[39;49m [33mn[39;49m = strlen(in);[K
  [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < n; i++) {[K
    [1m[36mif[0m[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [1m[36melse[0m[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"Hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 1; i < argc; i++) {[K
      [1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m = argv[i];[K
      [32mchar[39;49m [33mfriendlyName[39;49m[strlen(name)];[K
      upcase_words(name, friendlyName);[K
      say_hello(friendlyName);[K
    }[K
  }[K
  [1m[36mreturn[0m[39;49m 0;[K
}[K
[K
[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit-lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[K[54;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[54;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[54;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[54;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[54;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[54;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[54;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[54;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[54;34H[?25l[7m10[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[16;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[17;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[18;1H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[19;1H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[20;1H[?12l[?25h[?12;25h[54;34H[?25l[7m20[0m[39;49m[27m[21;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[22;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[23;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[24;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[25;1H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[26;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[27;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[28;1H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[29;1H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[30;1H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[29;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[28;1H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[29;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[28;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[27;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[28;1H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[29;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[28;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[27;1H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[26;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[25;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[24;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[23;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[22;1H[?12l[?25h[?12;25h[54;35H[?25l[7m0[0m[39;49m[27m[21;1H[?12l[?25h[?12;25h[54;34H[?25l[7m19[0m[39;49m[27m[20;1H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[19;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[18;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[17;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[54;35H[?25l[7m5[0m[39;49m[27m[16;9H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;9H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[?25l+;[54;6H[7m**[0m[39;49m[27m[15;22H[?12l[?25h[?12;25h[?25l1;[?12l[?25h[?12;25h[55;1H[?25lSaving file /home/akozina2/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello.c...[15;23H[?12l[?25h[?12;25h[55;1H[?25lWrote /home/akozina2/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello.c[K[15;23H[?12l[?25h[?12;25h[54;6H[?25l[7m----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L14   [0m[39;49m[27m[7mGit:[0m[39;49m[27m[15;23H[?12l[?25h[?12;25h[55;1H[K[15;23H[55;1H[?25l(No changes need to be saved)[15;23H[?12l[?25h[?12;25h[55;1H[K[15;23H[55;1H[?25l(No changes need to be saved)[15;23H[?12l[?25h[?12;25h[55;1H[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[13]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ emacs hello.c[4Pgdb helloemacs hello.c[4Pgdb hello./hello 'lisa simpson' 'bart simpson'                [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Clisa bart  [20P[C[C[C[C[C[C[C[C[C[C[C[C[C[C[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C'lisa simps[20@on' 'bart simpson'  [C[C[C[C[C[C[C[C[C[C[C[C[C[C[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[9Pgdb hello
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cemacs hello.c[K[K[K[K[K[K[K[K[K[K[K[K[Kmake
cc -g -Wall -std=c18    hello.c   -o hello
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ makeemacs hello.c[4Pgdb helloemacs hello.c[4Pgdb hello./hello 'lisa simpson' 'bart simpson'                [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Clisa bart  [20P[C[C[C[C[C[C[C[C[C[C[C[C[C[C[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C'lisa simps[20@on' 'bart simpson'  [C[C[C[C[C[C[C[C[C[C[C[C[C[C
Hello Lisa Simpson
Hello Bart Simpson
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'lisa simpson' 'bart simpson'                [1@ [1@c[1@a[1@r[1@l[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C./hello 'lisa simpson' 'bart simpson carl'                [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C./hello 'lisa simpson' 'bart simpson carl'                [C[1@ [1@c[1@a[1@r[1@l
Hello Lisa Simpson Carl
Hello Bart Simpson Carl
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'lisa simpson carl' 'bart simpson carl'                [C[C[C[10P' 'bart simpson[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cemacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[55d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[54d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[55;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[55;54H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[55;59H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[55;58H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[55;60H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[55;57H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[55;77H[?25ldone[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[55;75H[?25ldone[H
[?12l[?25h[?12;25h[55;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[55;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55;61H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[55;4H[?25ldone[H
[?12l[?25h[?12;25h[55d[K[54;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[54;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[54;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[54;75H[?25ldone[H
[?12l[?25h[?12;25h[54;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[54;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[54;64H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[54;65H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[54;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<ctype.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<string.h>[39;49m[K
[K
[32m/** Upcase the initial letter of each word from in, copying the [39;49m                             
[A
[32m *  results into out.  The caller is responsible to ensure that out [39;49m                         
[A
[32m *  has enough space for the strlen(in) characters of in. [39;49m                                   
[A
[32m */[39;49m[K
[32mvoid[39;49m[K
[1m[34mupcase_words[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m [33min[39;49m[], [32mchar[39;49m [33mout[39;49m[])[K
{[K
  [32mint[39;49m [33minWord[39;49m = 0;[K
  [32mint[39;49m [33mn[39;49m = strlen(in)+1;[K
  [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < n; i++) {[K
    [1m[36mif[0m[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [1m[36melse[0m[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"Hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 1; i < argc; i++) {[K
      [1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m = argv[i];[K
      [32mchar[39;49m [33mfriendlyName[39;49m[strlen(name)];[K
      upcase_words(name, friendlyName);[K
      say_hello(friendlyName);[K
    }[K
  }[K
  [1m[36mreturn[0m[39;49m 0;[K
}[K
[K
[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit:lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[K[54;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[54;34H[?25l[7m1[0m[39;49m[27m[H
[?12l[?25h[?12;25h[55d[?25lBeginning of buffer[H
[?12l[?25h[?12;25h[55d[K[54;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[54;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[54;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[54;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[54;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[54;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[54;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[54;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[54;34H[?25l[7m10[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[16;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[17;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[18;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[17;1H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[16;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C[?25l;[K[54;6H[7m**[0m[39;49m[27m[15;22H[?12l[?25h[?12;25h[?25l;[K[?12l[?25h[?12;25h[55;1H[?25lSaving file /home/akozina2/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello.c...[15;21H[?12l[?25h[?12;25h[55;1H[?25lWrote /home/akozina2/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello.c[K[15;21H[?12l[?25h[?12;25h[54;6H[?25l[7m----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L14   [0m[39;49m[27m[7mGit-[0m[39;49m[27m[15;21H[?12l[?25h[?12;25h[55;1H[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[14]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ emacs hello.c./hello 'lisa simpson carl' 'bart simpson carl'                [C[C[C[10P' 'bart simpson[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
cc -g -Wall -std=c18    hello.c   -o hello
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ makeemacs hello.c./hello 'lisa simpson carl' 'bart simpson carl'                
Hello Lisa Simpson Carl
Hello Bart Simpson Carl
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'lisa simpson carl' 'bart simpson carl'                [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cemacs hello.c./hello 'lisa simpson carl' 'bart simpson carl'                [C[C[C[10P' 'bart simpson[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
Hello Lisa SimpsonU
Hello Bart SimpsonU
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'lisa simpson' 'bart simpson'                [C[C[C[10@ carl' 'bart simpson carl[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[1P[1P
Hello Lisa Simpsoncarl%ʵ
Hello Bart Simpsoncarl%ʵ
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'lisa simpsoncarl' 'bart simpsoncarl'                [C[C[C[8P' 'bart simpson[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[10@ carl' 'bart simpson carl[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cemacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[55d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[54d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[55;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[55;54H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[55;59H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[55;58H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[55;60H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[55;57H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[55;77H[?25ldone[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[55;75H[?25ldone[H
[?12l[?25h[?12;25h[55;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[55;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55;61H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[55;4H[?25ldone[H
[?12l[?25h[?12;25h[55d[K[54;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[54;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[54;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[54;75H[?25ldone[H
[?12l[?25h[?12;25h[54;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[54;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[54;64H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[54;65H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[54;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<ctype.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<string.h>[39;49m[K
[K
[32m/** Upcase the initial letter of each word from in, copying the [39;49m                             
[A
[32m *  results into out.  The caller is responsible to ensure that out [39;49m                         
[A
[32m *  has enough space for the strlen(in) characters of in. [39;49m                                   
[A
[32m */[39;49m[K
[32mvoid[39;49m[K
[1m[34mupcase_words[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m [33min[39;49m[], [32mchar[39;49m [33mout[39;49m[])[K
{[K
  [32mint[39;49m [33minWord[39;49m = 0;[K
  [32mint[39;49m [33mn[39;49m = strlen(in);[K
  [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < n; i++) {[K
    [1m[36mif[0m[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [1m[36melse[0m[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"Hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 1; i < argc; i++) {[K
      [1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m = argv[i];[K
      [32mchar[39;49m [33mfriendlyName[39;49m[strlen(name)];[K
      upcase_words(name, friendlyName);[K
      say_hello(friendlyName);[K
    }[K
  }[K
  [1m[36mreturn[0m[39;49m 0;[K
}[K
[K
[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit-lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[K[54;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[54;34H[?25l[7m1[0m[39;49m[27m[H
[?12l[?25h[?12;25h[54;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[54;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[54;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[54;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[54;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[54;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[54;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[54;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[54;34H[?25l[7m10[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[?25l+;[54;6H[7m**[0m[39;49m[27m[15;22H[?12l[?25h[?12;25h[?25l1;[?12l[?25h[?12;25h[55;1H[?25lSaving file /home/akozina2/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello.c...[15;23H[?12l[?25h[?12;25h[55;1H[?25lWrote /home/akozina2/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello.c[K[15;23H[?12l[?25h[?12;25h[54;6H[?25l[7m----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L14   [0m[39;49m[27m[7mGit:[0m[39;49m[27m[15;23H[?12l[?25h[?12;25h[55;1H[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[15]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ emacs hello.c./hello 'lisa simpsoncarl' 'bart simpsoncarl'                [C[C[C[8P' 'bart simpson[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[10@ carl' 'bart simpson carl[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
cc -g -Wall -std=c18    hello.c   -o hello
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ makeemacs hello.c./hello 'lisa simpsoncarl' 'bart simpsoncarl'                [C[C[C[8P' 'bart simpson[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
Hello Lisa Simpson
Hello Bart Simpson
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'lisa simpson' 'bart simpson'                [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cemacs hello.c./hello 'lisa simpsoncarl' 'bart simpsoncarl'                
Hello Lisa Simpsoncarl
Hello 
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'lisa simpsoncarl' 'bart simpsoncarl'                
Hello Lisa Simpsoncarl
Segmentation fault
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'lisa simpsoncarl' 'bart simpsoncarl'                [C[C[C[8P' 'bart simpson[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C./hello 'lisa simpson' 'bart simpson'                
Hello Lisa Simpson
Hello Bart Simpson
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ he[K[K./hello 'lisa simpson' 'bart simpson'                [C[C[C[8@carl' 'bart simpsoncarl[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[8P' 'bart simpson[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cemacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[55d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[54d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[55;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[55;54H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[55;59H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[55;58H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[55;60H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[55;57H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[55;77H[?25ldone[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[55;75H[?25ldone[H
[?12l[?25h[?12;25h[55;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[55;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55;61H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[55;4H[?25ldone[H
[?12l[?25h[?12;25h[55d[K[54;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[54;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[54;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[54;75H[?25ldone[H
[?12l[?25h[?12;25h[54;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[54;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[54;64H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[54;65H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[54;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<ctype.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<string.h>[39;49m[K
[K
[32m/** Upcase the initial letter of each word from in, copying the [39;49m                             
[A
[32m *  results into out.  The caller is responsible to ensure that out [39;49m                         
[A
[32m *  has enough space for the strlen(in) characters of in. [39;49m                                   
[A
[32m */[39;49m[K
[32mvoid[39;49m[K
[1m[34mupcase_words[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m [33min[39;49m[], [32mchar[39;49m [33mout[39;49m[])[K
{[K
  [32mint[39;49m [33minWord[39;49m = 0;[K
  [32mint[39;49m [33mn[39;49m = strlen(in)+1;[K
  [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < n; i++) {[K
    [1m[36mif[0m[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [1m[36melse[0m[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"Hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 1; i < argc; i++) {[K
      [1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m = argv[i];[K
      [32mchar[39;49m [33mfriendlyName[39;49m[strlen(name)];[K
      upcase_words(name, friendlyName);[K
      say_hello(friendlyName);[K
    }[K
  }[K
  [1m[36mreturn[0m[39;49m 0;[K
}[K
[K
[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit:lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[K[2d[54;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[54;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[54;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[54;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[54;34H[?25l[7m10[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[16;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[17;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[18;1H[?12l[?25h[?12;25h[55d[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[16]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ emacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[55d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[54d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[55;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[55;54H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[55;59H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[55;58H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[55;60H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[55;57H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[55;77H[?25ldone[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[55;75H[?25ldone[H
[?12l[?25h[?12;25h[55;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[55;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55;61H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[55;4H[?25ldone[H
[?12l[?25h[?12;25h[55d[K[54;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[54;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[54;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[54;75H[?25ldone[H
[?12l[?25h[?12;25h[54;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[54;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[54;64H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[54;65H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[54;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<ctype.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<string.h>[39;49m[K
[K
[32m/** Upcase the initial letter of each word from in, copying the [39;49m                             
[A
[32m *  results into out.  The caller is responsible to ensure that out [39;49m                         
[A
[32m *  has enough space for the strlen(in) characters of in. [39;49m                                   
[A
[32m */[39;49m[K
[32mvoid[39;49m[K
[1m[34mupcase_words[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m [33min[39;49m[], [32mchar[39;49m [33mout[39;49m[])[K
{[K
  [32mint[39;49m [33minWord[39;49m = 0;[K
  [32mint[39;49m [33mn[39;49m = strlen(in)+1;[K
  [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < n; i++) {[K
    [1m[36mif[0m[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [1m[36melse[0m[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"Hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 1; i < argc; i++) {[K
      [1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m = argv[i];[K
      [32mchar[39;49m [33mfriendlyName[39;49m[strlen(name)];[K
      upcase_words(name, friendlyName);[K
      say_hello(friendlyName);[K
    }[K
  }[K
  [1m[36mreturn[0m[39;49m 0;[K
}[K
[K
[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit:lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[K[2d[54;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[54;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[54;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[54;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[54;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[54;34H[?25l[7m1[0m[39;49m[27m[H
[?12l[?25h[?12;25h[55d[?25lBeginning of buffer[H
[?12l[?25h[?12;25h[55d[K[54;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[54;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[54;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[54;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[54;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[54;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[54;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[54;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[54;34H[?25l[7m10[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C[?25l;[K[54;6H[7m**[0m[39;49m[27m[15;22H[?12l[?25h[?12;25h[?25l2;[?12l[?25h[?12;25h[55;1H[?25lSaving file /home/akozina2/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello.c...[15;23H[?12l[?25h[?12;25h[55;1H[?25lWrote /home/akozina2/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello.c[K[15;23H[?12l[?25h[?12;25h[54;6H[?25l[7m--[0m[39;49m[27m[15;23H[?12l[?25h[?12;25h[55;1H[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[17]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ amke[K[K[K[Kmake
cc -g -Wall -std=c18    hello.c   -o hello
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ makeemacs hello.c./hello 'lisa simpson' 'bart simpson'                
Hello Lisa Simpson
Hello Bart Simpson
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'lisa simpson' 'bart simpson'                [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cemacs hello.c./hello 'lisa simpson' 'bart simpson'                [C[C[C[8@carl' 'bart simpsoncarl[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
Hello Lisa Simpsoncarl
Segmentation fault
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'lisa simpsoncarl' 'bart simpsoncarl'                [C[C[C[8P' 'bart simpson[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cemacs hello.c./hello 'lisa simpson' 'bart simpson'                
Hello Lisa Simpson
Hello Bart Simpson
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'lisa simpson' 'bart simpson'                [C[C[C[8@carl' 'bart simpsoncarl[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[8P' 'bart simpson[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cemacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[55d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[54d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[55;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[55;54H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[55;59H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[55;58H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[55;60H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[55;57H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[55;77H[?25ldone[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[55;75H[?25ldone[H
[?12l[?25h[?12;25h[55;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[55;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55;61H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[55;4H[?25ldone[H
[?12l[?25h[?12;25h[55d[K[54;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[54;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[54;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[54;75H[?25ldone[H
[?12l[?25h[?12;25h[54;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[54;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[54;64H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[54;65H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[54;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<ctype.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<string.h>[39;49m[K
[K
[32m/** Upcase the initial letter of each word from in, copying the [39;49m                             
[A
[32m *  results into out.  The caller is responsible to ensure that out [39;49m                         
[A
[32m *  has enough space for the strlen(in) characters of in. [39;49m                                   
[A
[32m */[39;49m[K
[32mvoid[39;49m[K
[1m[34mupcase_words[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m [33min[39;49m[], [32mchar[39;49m [33mout[39;49m[])[K
{[K
  [32mint[39;49m [33minWord[39;49m = 0;[K
  [32mint[39;49m [33mn[39;49m = strlen(in)+2;[K
  [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < n; i++) {[K
    [1m[36mif[0m[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [1m[36melse[0m[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"Hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 1; i < argc; i++) {[K
      [1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m = argv[i];[K
      [32mchar[39;49m [33mfriendlyName[39;49m[strlen(name)];[K
      upcase_words(name, friendlyName);[K
      say_hello(friendlyName);[K
    }[K
  }[K
  [1m[36mreturn[0m[39;49m 0;[K
}[K
[K
[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit:lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[K[2d[54;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[54;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[54;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[54;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[54;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[54;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[54;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[54;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[54;34H[?25l[7m10[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C[?25l;[K[54;6H[7m**[0m[39;49m[27m[15;22H[?12l[?25h[?12;25h[?25l1;[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[16;23H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[17;23H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[18;23H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[19;6H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[20;11H[?12l[?25h[?12;25h[54;34H[?25l[7m20[0m[39;49m[27m[21;22H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[22;6H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[23;23H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[24;4H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[25;2H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[26;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[27;12H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[28;23H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[29;2H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[30;23H[?12l[?25h[?12;25h[54;34H[?25l[7m30[0m[39;49m[27m[31;2H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[32;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[33;4H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[34;23H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[35;2H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[36;19H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[37;23H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[38;13H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[39;4H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[40;9H[?12l[?25h[?12;25h[54;34H[?25l[7m40[0m[39;49m[27m[41;23H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[42;23H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[43;23H[?12l[?25h[?12;25h		[C[C[C[C[55;1H[?25lAuto-saving...[43;29H[?12l[?25h[?12;25h[55;15H[?25ldone[43;29H[?12l[?25h[?12;25h[55;1H[K[54;35H[?25l[7m3[0m[39;49m[27m[44;29H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[43;29H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[42;29H[?12l[?25h[?12;25h[54;35H[?25l[7m0[0m[39;49m[27m[41;29H[?12l[?25h[?12;25h[54;34H[?25l[7m39[0m[39;49m[27m[40;9H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[39;4H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[38;13H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[37;29H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[36;19H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[35;2H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[34;29H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[33;4H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[32;1H[?12l[?25h[?12;25h[54;35H[?25l[7m0[0m[39;49m[27m[31;2H[?12l[?25h[?12;25h[54;34H[?25l[7m29[0m[39;49m[27m[30;29H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[29;2H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[28;28H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[27;12H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[26;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[25;2H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[26;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[27;12H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[28;28H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[29;2H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[30;29H[?12l[?25h[?12;25h[54;34H[?25l[7m30[0m[39;49m[27m[31;2H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[32;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[33;4H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[34;29H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[35;2H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[36;19H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[37;29H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[38;13H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[39;4H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[40;9H[?12l[?25h[?12;25h[54;34H[?25l[7m40[0m[39;49m[27m[41;29H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[42;29H[?12l[?25h[?12;25h[54;35H[?25l[7m0[0m[39;49m[27m[41;29H[?12l[?25h[?12;25h[54;34H[?25l[7m39[0m[39;49m[27m[40;9H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[39;4H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[38;13H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[37;29H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[36;19H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[35;2H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[34;29H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[33;4H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[32;1H[?12l[?25h[?12;25h[54;35H[?25l[7m0[0m[39;49m[27m[31;2H[?12l[?25h[?12;25h[54;34H[?25l[7m29[0m[39;49m[27m[30;29H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[29;2H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[28;28H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[27;12H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[26;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[25;2H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[24;4H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[23;29H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[22;6H[?12l[?25h[?12;25h[54;35H[?25l[7m0[0m[39;49m[27m[21;22H[?12l[?25h[?12;25h[54;34H[?25l[7m19[0m[39;49m[27m[20;11H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[19;6H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[17;29H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[16;29H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;24H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[16;29H[?12l[?25h[?12;25h[?25l+; i++) {			[?12l[?25h[?12;25h[?25l1; i++) {[16;26H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;24H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[14;18H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;24H[?12l[?25h[?12;25h[?25l;[K[?12l[?25h[?12;25h[?25l;[K[?12l[?25h[?12;25h[55;1H[?25lAuto-saving...[15;21H[?12l[?25h[?12;25h[55;15H[?25ldone[15;21H[?12l[?25h[?12;25h[55;1H[K[54;35H[?25l[7m5[0m[39;49m[27m[16;21H[?12l[?25h[?12;25h[C[C		[C[?25l; i++) {[K			[?12l[?25h[?12;25h[?25l; i++) {[K			[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;22H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[14;18H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;22H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[16;24H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;22H[?12l[?25h[?12;25h[?25l+;[?12l[?25h[?12;25h[?25l1;[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[16;23H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[17;23H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[18;23H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[19;6H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[20;11H[?12l[?25h[?12;25h[54;34H[?25l[7m20[0m[39;49m[27m[21;22H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[22;6H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[23;23H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[24;4H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[25;2H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[26;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[27;12H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[28;23H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[29;2H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[30;23H[?12l[?25h[?12;25h[54;34H[?25l[7m30[0m[39;49m[27m[31;2H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[32;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[33;4H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[34;23H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[35;2H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[36;19H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[37;23H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[38;13H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[39;4H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[40;9H[?12l[?25h[?12;25h[54;34H[?25l[7m40[0m[39;49m[27m[41;23H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[42;23H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[43;23H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[44;23H[?12l[?25h[?12;25h		[C[C[C[C[C[C		[C[C[C[C[C[?25l+);[?12l[?25h[?12;25h[?25l1);[?12l[?25h[?12;25h[55;1H[?25lSaving file /home/akozina2/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello.c...[44;40H[?12l[?25h[?12;25h[55;1H[?25lWrote /home/akozina2/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello.c[K[44;40H[?12l[?25h[?12;25h[54;6H[?25l[7m--[0m[39;49m[27m[44;40H[?12l[?25h[?12;25h[55;1H[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[18]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ emacs hello.c./hello 'lisa simpson' 'bart simpson'                [C[C[C[8@carl' 'bart simpsoncarl[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[8P' 'bart simpson[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
cc -g -Wall -std=c18    hello.c   -o hello
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ makeemacs hello.c./hello 'lisa simpson' 'bart simpson'                [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[5Pemacs hello.c
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C./hello 'lisa simpson' 'bart simpson'                
Hello Lisa Simpson
Hello Bart Simpson
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'lisa simpson' 'bart simpson'                [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cemacs hello.c./hello 'lisa simpson' 'bart simpson'                [C[C[C[8@carl' 'bart simpsoncarl[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
Hello Lisa Simpsoncarl
Segmentation fault
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'lisa simpsoncarl' 'bart simpsoncarl'                [C[C[C[8P' 'bart simpson[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cemacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[55d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[54d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[55;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[55;54H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[55;59H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[55;58H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[55;60H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[55;57H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[55;77H[?25ldone[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[55;75H[?25ldone[H
[?12l[?25h[?12;25h[55;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[55;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55;61H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[55;4H[?25ldone[H
[?12l[?25h[?12;25h[55d[K[54;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[54;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[54;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[54;75H[?25ldone[H
[?12l[?25h[?12;25h[54;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[54;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[54;64H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[54;65H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[54;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<ctype.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<string.h>[39;49m[K
[K
[32m/** Upcase the initial letter of each word from in, copying the [39;49m                             
[A
[32m *  results into out.  The caller is responsible to ensure that out [39;49m                         
[A
[32m *  has enough space for the strlen(in) characters of in. [39;49m                                   
[A
[32m */[39;49m[K
[32mvoid[39;49m[K
[1m[34mupcase_words[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m [33min[39;49m[], [32mchar[39;49m [33mout[39;49m[])[K
{[K
  [32mint[39;49m [33minWord[39;49m = 0;[K
  [32mint[39;49m [33mn[39;49m = strlen(in)+1;[K
  [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < n; i++) {[K
    [1m[36mif[0m[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [1m[36melse[0m[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"Hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 1; i < argc; i++) {[K
      [1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m = argv[i];[K
      [32mchar[39;49m [33mfriendlyName[39;49m[strlen(name)];[K
      upcase_words(name, friendlyName+1);[K
      say_hello(friendlyName);[K
    }[K
  }[K
  [1m[36mreturn[0m[39;49m 0;[K
}[K
[K
[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit:lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lBeginning of buffer[K[H
[?12l[?25h[?12;25h[55d[K[54;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[54;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[54;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[54;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[54;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[54;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[54;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[54;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[54;34H[?25l[7m10[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[16;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[17;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[18;1H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[19;1H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[20;1H[?12l[?25h[?12;25h[54;34H[?25l[7m20[0m[39;49m[27m[21;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[22;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[23;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[24;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[25;1H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[26;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[27;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[28;1H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[29;1H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[30;1H[?12l[?25h[?12;25h[54;34H[?25l[7m30[0m[39;49m[27m[31;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[32;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[33;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[34;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[35;1H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[36;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[37;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[38;1H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[39;1H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[40;1H[?12l[?25h[?12;25h[54;34H[?25l[7m40[0m[39;49m[27m[41;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[42;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[43;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[44;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[44;28H[C[C[C		[C[C[C[C[C[C	[?25l);[K[54;6H[7m**[0m[39;49m[27m[44;39H[?12l[?25h[?12;25h[?25l);[K[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[45;31H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[44;29H[?12l[?25h[?12;25h[55;1H[?25lAuto-saving...[44;29H[?12l[?25h[?12;25h[55;15H[?25ldone[44;29H[?12l[?25h[?12;25h[55;1H[K[54;35H[?25l[7m2[0m[39;49m[27m[43;29H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[42;29H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[43;29H[?12l[?25h[?12;25h[?25l[1@=[?12l[?25h[?12;25h[?25l[1@ [?12l[?25h[?12;25h[C[?25l[1@ [?12l[?25h[?12;25h[55;1H[?25lC-x[43;27H[?12l[?25h[?12;25h[55;4H[?25l-[43;27H[?12l[?25h[?12;25h[55;4H[?25l C-s[43;27H[?12l[?25h[?12;25h[55;1H[?25lSaving file /home/akozina2/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello.c...[43;27H[?12l[?25h[?12;25h[55;1H[?25lWrote /home/akozina2/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello.c[K[43;27H[?12l[?25h[?12;25h[54;6H[?25l[7m--[0m[39;49m[27m[43;27H[?12l[?25h[?12;25h[55;1H[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[19]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ emacs hello.c./hello 'lisa simpsoncarl' 'bart simpsoncarl'                [C[C[C[8P' 'bart simpson[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
cc -g -Wall -std=c18    hello.c   -o hello
[01m[Khello.c:[m[K In function ‘[01m[Kmain[m[K’:
[01m[Khello.c:42:27:[m[K [01;31m[Kerror: [m[Kexpected expression before ‘[01m[K[[m[K’ token
       char friendlyName = [01;31m[K[[m[Kstrlen(name)];
                           [01;31m[K^[m[K
[01m[Khello.c:43:26:[m[K [01;35m[Kwarning: [m[Kpassing argument 2 of ‘[01m[Kupcase_words[m[K’ makes pointer from integer without a cast [[01;35m[K-Wint-conversion[m[K]
       upcase_words(name, [01;35m[KfriendlyName[m[K);
                          [01;35m[K^~~~~~~~~~~~[m[K
[01m[Khello.c:11:36:[m[K [01;36m[Knote: [m[Kexpected ‘[01m[Kchar *[m[K’ but argument is of type ‘[01m[Kchar[m[K’
 upcase_words(const char in[], [01;36m[Kchar out[][m[K)
                               [01;36m[K~~~~~^~~~~[m[K
[01m[Khello.c:44:17:[m[K [01;35m[Kwarning: [m[Kpassing argument 1 of ‘[01m[Ksay_hello[m[K’ makes pointer from integer without a cast [[01;35m[K-Wint-conversion[m[K]
       say_hello([01;35m[KfriendlyName[m[K);
                 [01;35m[K^~~~~~~~~~~~[m[K
[01m[Khello.c:27:23:[m[K [01;36m[Knote: [m[Kexpected ‘[01m[Kconst char *[m[K’ but argument is of type ‘[01m[Kchar[m[K’
 say_hello([01;36m[Kconst char *name[m[K)
           [01;36m[K~~~~~~~~~~~~^~~~[m[K
make: *** [<builtin>: hello] Error 1
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ makeemacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[55d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[54d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[55;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[55;54H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[55;59H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[55;58H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[55;60H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[55;57H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[55;77H[?25ldone[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[55;75H[?25ldone[H
[?12l[?25h[?12;25h[55;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[55;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55;61H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[55;4H[?25ldone[H
[?12l[?25h[?12;25h[55d[K[54;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[54;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[54;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[54;75H[?25ldone[H
[?12l[?25h[?12;25h[54;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[54;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[54;64H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[54;65H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[54;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<ctype.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<string.h>[39;49m[K
[K
[32m/** Upcase the initial letter of each word from in, copying the [39;49m                             
[A
[32m *  results into out.  The caller is responsible to ensure that out [39;49m                         
[A
[32m *  has enough space for the strlen(in) characters of in. [39;49m                                   
[A
[32m */[39;49m[K
[32mvoid[39;49m[K
[1m[34mupcase_words[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m [33min[39;49m[], [32mchar[39;49m [33mout[39;49m[])[K
{[K
  [32mint[39;49m [33minWord[39;49m = 0;[K
  [32mint[39;49m [33mn[39;49m = strlen(in)+1;[K
  [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < n; i++) {[K
    [1m[36mif[0m[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [1m[36melse[0m[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"Hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 1; i < argc; i++) {[K
      [1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m = argv[i];[K
      [32mchar[39;49m [33mfriendlyName[39;49m = [strlen(name)];[K
      upcase_words(name, friendlyName);[K
      say_hello(friendlyName);[K
    }[K
  }[K
  [1m[36mreturn[0m[39;49m 0;[K
}[K
[K
[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit:lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[K[54;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[54;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[54;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[54;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[54;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[54;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[54;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[54;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[54;34H[?25l[7m10[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[16;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[17;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[18;1H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[19;1H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[20;1H[?12l[?25h[?12;25h[54;34H[?25l[7m20[0m[39;49m[27m[21;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[22;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[23;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[24;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[25;1H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[26;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[27;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[28;1H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[29;1H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[30;1H[?12l[?25h[?12;25h[54;34H[?25l[7m30[0m[39;49m[27m[31;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[32;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[33;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[34;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[35;1H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[36;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[37;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[38;1H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[39;1H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[40;1H[?12l[?25h[?12;25h[54;34H[?25l[7m40[0m[39;49m[27m[41;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[42;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[43;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[?25l[1P[54;6H[7m**[0m[39;49m[27m[43;26H[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[44;24H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[45;24H[?12l[?25h[?12;25h	[C[C[C[C[55;1H[?25lSaving file /home/akozina2/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello.c...[45;29H[?12l[?25h[?12;25h[55;1H[?25lWrote /home/akozina2/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello.c[K[45;29H[?12l[?25h[?12;25h[54;6H[?25l[7m--[0m[39;49m[27m[45;29H[?12l[?25h[?12;25h[55;1H[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[20]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ emacs hello.cmake[Kemacs hello.cmake[K
cc -g -Wall -std=c18    hello.c   -o hello
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ makeemacs hello.cmake[Kemacs hello.c./hello 'lisa simpsoncarl' 'bart simpsoncarl'                
Hello Lisa Simpsoncarl
Segmentation fault
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'lisa simpsoncarl' 'bart simpsoncarl'                [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cemacs hello.cmake[Kemacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[55d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[54d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[55;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[55;54H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[55;59H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[55;58H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[55;60H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[55;57H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[55;77H[?25ldone[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[55;75H[?25ldone[H
[?12l[?25h[?12;25h[55;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[55;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55;61H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[55;4H[?25ldone[H
[?12l[?25h[?12;25h[55d[K[54;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[54;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[54;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[54;75H[?25ldone[H
[?12l[?25h[?12;25h[54;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[54;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[54;64H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[54;65H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[54;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<ctype.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<string.h>[39;49m[K
[K
[32m/** Upcase the initial letter of each word from in, copying the [39;49m                             
[A
[32m *  results into out.  The caller is responsible to ensure that out [39;49m                         
[A
[32m *  has enough space for the strlen(in) characters of in. [39;49m                                   
[A
[32m */[39;49m[K
[32mvoid[39;49m[K
[1m[34mupcase_words[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m [33min[39;49m[], [32mchar[39;49m [33mout[39;49m[])[K
{[K
  [32mint[39;49m [33minWord[39;49m = 0;[K
  [32mint[39;49m [33mn[39;49m = strlen(in)+1;[K
  [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < n; i++) {[K
    [1m[36mif[0m[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [1m[36melse[0m[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"Hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 1; i < argc; i++) {[K
      [1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m = argv[i];[K
      [32mchar[39;49m [33mfriendlyName[39;49m[strlen(name)];[K
      upcase_words(name, friendlyName);[K
      say_hello(friendlyName);[K
    }[K
  }[K
  [1m[36mreturn[0m[39;49m 0;[K
}[K
[K
[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit:lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[K[54;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[54;34H[?25l[7m1[0m[39;49m[27m[H
[?12l[?25h[?12;25h[54;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[54;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[54;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[54;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[54;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[54;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[54;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[54;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[54;34H[?25l[7m10[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[16;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[17;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[18;1H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[19;1H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[20;1H[?12l[?25h[?12;25h[54;34H[?25l[7m20[0m[39;49m[27m[21;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[22;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[23;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[24;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[25;1H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[26;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[27;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[28;1H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[29;1H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[30;1H[?12l[?25h[?12;25h[54;34H[?25l[7m30[0m[39;49m[27m[31;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[32;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[33;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[34;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[35;1H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[36;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[37;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[38;1H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[39;1H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[40;1H[?12l[?25h[?12;25h[54;34H[?25l[7m40[0m[39;49m[27m[41;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[42;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[43;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[44;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[?25l+);[54;6H[7m**[0m[39;49m[27m[44;39H[?12l[?25h[?12;25h[?25l1);[?12l[?25h[?12;25h[55;1H[?25lSaving file /home/akozina2/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello.c...[44;40H[?12l[?25h[?12;25h[55;1H[?25lWrote /home/akozina2/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello.c[K[44;40H[?12l[?25h[?12;25h[54;6H[?25l[7m--[0m[39;49m[27m[44;40H[?12l[?25h[?12;25h[55;1H[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[21]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ emacs hello.c./hello 'lisa simpsoncarl' 'bart simpsoncarl'                [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
cc -g -Wall -std=c18    hello.c   -o hello
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ makeemacs hello.c./hello 'lisa simpsoncarl' 'bart simpsoncarl'                [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cemacs hello.cmake[Kemacs hello.c./hello 'lisa simpsoncarl' 'bart simpsoncarl'                
Hello Lisa Simpsoncarl
Segmentation fault
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ 2[K./hello 'lisa simpsoncarl' 'bart simpsoncarl'                [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cemacs hello.c./hello 'lisa simpsoncarl' 'bart simpsoncarl'                [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cemacs hello.cmake[Kemacs hello.c./hello 'lisa simpsoncarl' 'bart simpsoncarl'                [C[C[C[8P' 'bart simpson[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C./hello 'lisa simpson' 'bart simpson'                
Hello Lisa Simpson
Hello Bart Simpson
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'lisa simpson' 'bart simpson'                [C[C[C[8@carl' 'bart simpsoncarl[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cemacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[55d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[54d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[55;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[55;54H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[55;59H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[55;58H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[55;60H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[55;57H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[55;77H[?25ldone[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[55;75H[?25ldone[H
[?12l[?25h[?12;25h[55;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[55;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55;61H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[55;4H[?25ldone[H
[?12l[?25h[?12;25h[55d[K[54;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[54;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[54;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[54;75H[?25ldone[H
[?12l[?25h[?12;25h[54;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[54;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[54;64H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[54;65H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[54;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<ctype.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<string.h>[39;49m[K
[K
[32m/** Upcase the initial letter of each word from in, copying the [39;49m                             
[A
[32m *  results into out.  The caller is responsible to ensure that out [39;49m                         
[A
[32m *  has enough space for the strlen(in) characters of in. [39;49m                                   
[A
[32m */[39;49m[K
[32mvoid[39;49m[K
[1m[34mupcase_words[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m [33min[39;49m[], [32mchar[39;49m [33mout[39;49m[])[K
{[K
  [32mint[39;49m [33minWord[39;49m = 0;[K
  [32mint[39;49m [33mn[39;49m = strlen(in)+1;[K
  [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < n; i++) {[K
    [1m[36mif[0m[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [1m[36melse[0m[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"Hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 1; i < argc; i++) {[K
      [1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m = argv[i];[K
      [32mchar[39;49m [33mfriendlyName[39;49m[strlen(name)];[K
      upcase_words(name, friendlyName+1);[K
      say_hello(friendlyName);[K
    }[K
  }[K
  [1m[36mreturn[0m[39;49m 0;[K
}[K
[K
[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit:lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[K[54;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[54;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[54;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[54;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[54;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[54;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[54;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[54;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[54;34H[?25l[7m10[0m[39;49m[27m[11;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[12;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[13;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[14;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[15;1H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[16;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[17;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[18;1H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[19;1H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[20;1H[?12l[?25h[?12;25h[54;34H[?25l[7m20[0m[39;49m[27m[21;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[22;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[23;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[24;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[25;1H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[26;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[27;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[28;1H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[29;1H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[30;1H[?12l[?25h[?12;25h[54;34H[?25l[7m30[0m[39;49m[27m[31;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[32;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[33;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[34;1H[?12l[?25h[?12;25h[54;35H[?25l[7m4[0m[39;49m[27m[35;1H[?12l[?25h[?12;25h[54;35H[?25l[7m5[0m[39;49m[27m[36;1H[?12l[?25h[?12;25h[54;35H[?25l[7m6[0m[39;49m[27m[37;1H[?12l[?25h[?12;25h[54;35H[?25l[7m7[0m[39;49m[27m[38;1H[?12l[?25h[?12;25h[54;35H[?25l[7m8[0m[39;49m[27m[39;1H[?12l[?25h[?12;25h[54;35H[?25l[7m9[0m[39;49m[27m[40;1H[?12l[?25h[?12;25h[54;34H[?25l[7m40[0m[39;49m[27m[41;1H[?12l[?25h[?12;25h[54;35H[?25l[7m1[0m[39;49m[27m[42;1H[?12l[?25h[?12;25h[54;35H[?25l[7m2[0m[39;49m[27m[43;1H[?12l[?25h[?12;25h[54;35H[?25l[7m3[0m[39;49m[27m[44;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[?25l +1);[54;6H[7m**[0m[39;49m[27m[44;39H[?12l[?25h[?12;25h	[?25l 1);[?12l[?25h[?12;25h[55;1H[?25lSaving file /home/akozina2/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello.c...[44;41H[?12l[?25h[?12;25h[55;1H[?25lWrote /home/akozina2/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args/hello.c[K[44;41H[?12l[?25h[?12;25h[54;6H[?25l[7m--[0m[39;49m[27m[44;41H[?12l[?25h[?12;25h[55;1H[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[22]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ make
cc -g -Wall -std=c18    hello.c   -o hello
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ makeemacs hello.c./hello 'lisa simpson' 'bart simpson'                [C[C[C[8@carl' 'bart simpsoncarl[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
Hello Lisa Simpsoncarl
Segmentation fault
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'lisa simpsoncarl' 'bart simpsoncarl'                [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cemacs hello.c./hello 'lisa simpson' 'bart simpson'                [C[C[C[C[8@carl' 'bart simpsoncarl[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cmake[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cemacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[55d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[54d[?25l[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[55;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[55;54H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[55;59H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[55;58H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[55;60H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[55;57H[?25ldone[H
[?12l[?25h[?12;25h[55;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[55;77H[?25ldone[H
[?12l[?25h[?12;25h[55;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[55;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[55;75H[?25ldone[H
[?12l[?25h[?12;25h[55;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[55;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55;61H[?25ldone[H
[?12l[?25h[?12;25h[55;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[55d[?25l...[K[H[7mFile Edit Options Buffers Tools Help                                                         [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Fundamental) ----------------------------------------[0m[39;49m[27m
[A
Loading /usr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoloads.el (source)\
[A[2d[?12l[?25h[?12;25h[55;4H[?25ldone[H
[?12l[?25h[?12;25h[55d[K[54;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[54;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[54;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[54;75H[?25ldone[H
[?12l[?25h[?12;25h[54;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[54;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[54;64H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[54;65H[?25ldone[H
[?12l[?25h[?12;25h[54;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[54;54H[?25ldone[H
[?12l[?25h[?12;25h[54;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[54;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c]11;?\[>4;1m[?2004h[?1004h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                        [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[7m-UUU:----F1  [0m[39;49m[27m[7m[1m*scratch*   [0m[39;49m[27m[7m   All L1     (Lisp Interaction ElDoc) -----------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                       [0m[39;49m[27m
[A
[1m[34m#include[0m[39;49m [32m<ctype.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdio.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<stdlib.h>[39;49m[K
[1m[34m#include[0m[39;49m [32m<string.h>[39;49m[K
[K
[32m/** Upcase the initial letter of each word from in, copying the [39;49m                             
[A
[32m *  results into out.  The caller is responsible to ensure that out [39;49m                         
[A
[32m *  has enough space for the strlen(in) characters of in. [39;49m                                   
[A
[32m */[39;49m[K
[32mvoid[39;49m[K
[1m[34mupcase_words[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m [33min[39;49m[], [32mchar[39;49m [33mout[39;49m[])[K
{[K
  [32mint[39;49m [33minWord[39;49m = 0;[K
  [32mint[39;49m [33mn[39;49m = strlen(in)+1;[K
  [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 0; i < n; i++) {[K
    [1m[36mif[0m[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [1m[36melse[0m[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[1m[36mstatic[0m[39;49m [32mvoid[39;49m[K
[1m[34msay_hello[0m[39;49m([1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m)[K
{[K
  printf([32m"Hello %s\n"[39;49m, name);[K
}[K
[K
[32mint[39;49m[K
[1m[34mmain[0m[39;49m([32mint[39;49m [33margc[39;49m, [1m[36mconst[0m[39;49m [32mchar[39;49m *[33margv[39;49m[])[K
{[K
  [1m[36mif[0m[39;49m (argc == 1) {[K
    fprintf(stderr, [32m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [1m[36melse[0m[39;49m {[K
    [1m[36mfor[0m[39;49m ([32mint[39;49m [33mi[39;49m = 1; i < argc; i++) {[K
      [1m[36mconst[0m[39;49m [32mchar[39;49m *[33mname[39;49m = argv[i];[K
      [32mchar[39;49m [33mfriendlyName[39;49m[strlen(name)];[K
      upcase_words(name, friendlyName + 1);[K
      say_hello(friendlyName);[K
    }[K
  }[K
  [1m[36mreturn[0m[39;49m 0;[K
}[K
[K
[K
[K
[K
[7m-UU-:----F1  [0m[39;49m[27m[7m[1mhello.c     [0m[39;49m[27m[7m   All L1    [0m[39;49m[27m[7mGit:lab2[0m[39;49m[27m[7m  (C/*l Abbrev) -------------------------------[0m[39;49m[27m
[A[2d[?12l[?25h[?12;25h[55d[?25lBeginning of buffer[K[H
[?12l[?25h[?12;25h[55d[K[54;34H[?25l[7m2[0m[39;49m[27m[H

[?12l[?25h[?12;25h[54;34H[?25l[7m3[0m[39;49m[27m[4;1H[?12l[?25h[?12;25h[54;34H[?25l[7m4[0m[39;49m[27m[5;1H[?12l[?25h[?12;25h[54;34H[?25l[7m5[0m[39;49m[27m[6;1H[?12l[?25h[?12;25h[54;34H[?25l[7m6[0m[39;49m[27m[7;1H[?12l[?25h[?12;25h[54;34H[?25l[7m7[0m[39;49m[27m[8;1H[?12l[?25h[?12;25h[54;34H[?25l[7m8[0m[39;49m[27m[9;1H[?12l[?25h[?12;25h[54;34H[?25l[7m9[0m[39;49m[27m[10;1H[?12l[?25h[?12;25h[55d[?25l(No changes need to be saved)[10;1H[?12l[?25h[?12;25h[55d[K[?1004l[?2004l[>4m[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m
[23]+  Stopped                 emacs hello.c
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ d[KD
bash: D: command not found
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ exit
There are stopped jobs.
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ git add .
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ git commit -m ' co mpleted MILESTONE'
[lab2 b4832b1]  completed MILESTONE
 Committer: Anna Kozina <akozina2@cs.binghamton.edu>
Your name and email address were configured automatically based
on your username and hostname. Please check that they are accurate.
You can suppress this message by setting them explicitly. Run the
following command and follow the instructions in your editor to edit
your configuration file:

    git config --global --edit

After doing this, you may fix the identity used for this commit with:

    git commit --amend --reset-author

 1 file changed, 2 insertions(+), 2 deletions(-)
akozina2@remote01:~/cs220/i220b/submit/lab2/exercises/2-hello-upcase-args$ git push
Enumerating objects: 13, done.
Counting objects:   7% (1/13)Counting objects:  15% (2/13)Counting objects:  23% (3/13)Counting objects:  30% (4/13)Counting objects:  38% (5/13)Counting objects:  46% (6/13)Counting objects:  53% (7/13)Counting objects:  61% (8/13)Counting objects:  69% (9/13)Counting objects:  76% (10/13)Counting objects:  84% (11/13)Counting objects:  92% (12/13)Counting objects: 100% (13/13)C